[
  {
    "id": 1,
    "titolo": "Gestione di grandi web server",
    "categoria": "CDN",
    "contenuto": "Usare farm di server efficienti con bilanciatori di carico front-end che distribuiscono richieste su più server, tutti collegati allo stesso database backend."
  },
  {
    "id": 2,
    "titolo": "Cache Web (soluzione storica)",
    "categoria": "CDN",
    "contenuto": "Dispositivi che memorizzano copie locali di oggetti HTTP richiesti di recente per rispondere rapidamente come proxy."
  },
  {
    "id": 3,
    "titolo": "Benefici delle Cache Web",
    "categoria": "CDN",
    "contenuto": "Riduzione del traffico su link Internet costosi, miglioramento della latenza e throughput, e abilitazione di contenuti localizzati."
  },
  {
    "id": 4,
    "titolo": "Caching HTTP",
    "categoria": "CDN",
    "contenuto": "I client memorizzano documenti e verificano cambiamenti tramite header HTTP (Expires, Cache-Control, E-tag). Se il contenuto non è scaduto si usa la copia cache, altrimenti si verifica con il server (304 Not Modified o 200 OK)."
  },
  {
    "id": 5,
    "titolo": "Proxy Web",
    "categoria": "CDN",
    "contenuto": "Negli anni ’90 richiedevano configurazione manuale. Oggi proxy trasparenti sono comuni, ma SSL impedisce l'ispezione dati, obbligando accordi tra provider di contenuti e ISP per cache nei backbone."
  },
  {
    "id": 6,
    "titolo": "Problemi di cache e farm di server",
    "categoria": "CDN",
    "contenuto": "Non risolvono congestione o latenza di rete. Cache servono solo i loro utenti, non tutta Internet. Provider non possono fidarsi della cache. Problemi di conteggio accessi e molti oggetti HTTP non sono cacheabili."
  },
  {
    "id": 7,
    "titolo": "Content Delivery Networks (CDN)",
    "categoria": "CDN",
    "contenuto": "Rete sovrapposta di cache/server distribuiti vicini agli utenti che migliorano performance, RTT, disponibilità, bilanciamento carico e costi. Utilizzate per hosting distribuito, video on demand, streaming live, contenuti dinamici e pubblicità."
  },
  {
    "id": 8,
    "titolo": "CDN vs Caching Proxy",
    "categoria": "CDN",
    "contenuto": "Cache riducono banda per ISP, CDN migliorano QoS per provider e utenti. Cache sono reattive, CDN sono proattive. CDN danno controllo ai provider, proxy no."
  },
  {
    "id": 9,
    "titolo": "Replica contenuti in CDN",
    "categoria": "CDN",
    "contenuto": "CDN installa server in data center o vicino agli utenti e replica contenuti dei provider. Quando il provider aggiorna, la CDN aggiorna i server. Sfide: come, dove replicare, come trovare e scegliere replica, come indirizzare utenti."
  },
  {
    "id": 10,
    "titolo": "Selezione del server",
    "categoria": "CDN",
    "contenuto": "Criteri: minor carico, migliore performance, tolleranza a guasti, posizione geografica, RTT, throughput. Modi per indirizzare client: routing (anycast, bilanciamento cluster), applicazione (HTTP redirect), naming (DNS)."
  },
  {
    "id": 11,
    "titolo": "Metodi di selezione server",
    "categoria": "CDN",
    "contenuto": "IP anycast: trasparente ma con poco controllo e complessità di scalabilità. HTTP redirect: controllo preciso ma aumenta carico e latenza. DNS: adatto al caching, riduce RTT, ma la richiesta è dal resolver, non dal client, e la granularità è per hostname, non URL."
  },
  {
    "id": 12,
    "titolo": "CDN basate su DNS",
    "categoria": "CDN",
    "contenuto": "Il DNS agisce come 'content router' selezionando la replica migliore in base a metriche (RTT, carico server). Limiti: granularità solo a livello hostname, difficile separare contenuti statici e dinamici."
  },
  {
    "id": 13,
    "titolo": "Akamai",
    "categoria": "CDN",
    "contenuto": "Usa domini specifici per ogni cliente e suddivide contenuti in gruppi con nomi multipli. Le URL sono modificate per puntare ai domini Akamai, permettendo instradamenti differenziati per paesi o gruppi."
  },
  {
    "id": 14,
    "titolo": "Estensioni e limiti delle CDN",
    "categoria": "CDN",
    "contenuto": "Per maggiore granularità si usa HTTP redirect, che raddoppia le richieste e aumenta latenza. Le URL-based CDN usano URL completi ma richiedono terminazione TCP, costosa e con ritardi."
  },
  {
    "id": 15,
    "titolo": "Conclusioni sulle CDN",
    "categoria": "CDN",
    "contenuto": "CDN basate su DNS sono ampiamente usate per web e streaming. Le repliche possono contenere contenuti leggermente diversi (es. pubblicità locale). Content peering resta un problema aperto. Esempi noti: Akamai, Amazon CloudFront, Cloudflare, Limelight Networks."
  },
  {
    "id": 16,
    "titolo": "VPN IPsec",
    "categoria": "VPN",
    "contenuto": "Scopo: garantire comunicazioni sicure su reti pubbliche (es. Internet).\n\nFunzioni principali: cifratura, autenticazione, integrità dei dati, protezione contro replay.\n\nComponenti chiave:\n- AH (Authentication Header): autenticazione e integrità, senza cifratura.\n- ESP (Encapsulating Security Payload): cifratura + autenticazione + integrità.\n\nModalità:\n- Transport mode: protegge solo il payload IP.\n- Tunnel mode: incapsula l’intero pacchetto IP in un nuovo pacchetto IP.\n\nProtocollo di scambio chiavi: IKE (Internet Key Exchange).\n\nTipi di VPN: site-to-site (tra reti), remote access (client singoli).\n\nVantaggi: alta sicurezza, standard consolidato, interoperabilità.\n\nLimiti: configurazione complessa, overhead computazionale, possibile incompatibilità NAT senza NAT-T."
  },
  {
    "id": 17,
    "titolo": "Output Queuing nei Router",
    "categoria": "QoS",
    "contenuto": "L'output queuing serve a gestire il traffico in uscita nei router, evitando congestioni e perdita di pacchetti, e garantendo un'adeguata trasmissione dei pacchetti in ordine e senza sovraccaricare l'interfaccia di rete. Tuttavia, se non bilanciato correttamente, può limitare la scalabilità e le prestazioni del router."
  },
  {
    "id": 18,
    "titolo": "VRF nei router MPLS",
    "categoria": "MPLS VPN",
    "contenuto": "Le VRF (Virtual Routing and Forwarding) sono tabelle di routing separate gestite dai router PE (Provider Edge) in un'architettura MPLS VPN. Ogni cliente ha una propria VRF, che isola il traffico e mantiene la separazione logica delle reti. I router P (core) non gestiscono VRF e si occupano solo della commutazione dei pacchetti MPLS tramite le label."
  },
  {
    "id": 19,
    "titolo": "MPLS VPN",
    "categoria": "MPLS VPN",
    "contenuto": "Le MPLS VPN (Multiprotocol Label Switching Virtual Private Network) sono reti private virtuali che utilizzano la tecnologia MPLS per instradare pacchetti attraverso una rete condivisa. Offrono isolamento del traffico, sicurezza e scalabilità, consentendo a più clienti di condividere la stessa infrastruttura fisica senza compromettere la privacy dei dati."
  },
  {
    "id": 20,
    "titolo": "QoS nei router",
    "categoria": "QoS",
    "contenuto": "La QoS (Quality of Service) nei router è un insieme di tecniche e meccanismi progettati per garantire prestazioni affidabili e prevedibili per applicazioni e servizi di rete. Include la gestione della larghezza di banda, la priorizzazione del traffico, il controllo della congestione e l'allocazione delle risorse per ottimizzare l'esperienza utente."
  },
  {
    "id": 21,
    "titolo": "Congestione nei router",
    "categoria": "QoS",
    "contenuto": "La congestione nei router si verifica quando il traffico in ingresso supera la capacità di elaborazione del router, causando ritardi, perdita di pacchetti e degrado delle prestazioni. Le tecniche di gestione della congestione includono il buffering, la coda prioritaria e l'implementazione di algoritmi di controllo della congestione."
  },
  {
    "id": 22,
    "titolo": "Buffering nei router",
    "categoria": "QoS",
    "contenuto": "Il buffering nei router è una tecnica utilizzata per gestire i picchi di traffico e prevenire la perdita di pacchetti. I pacchetti in eccesso vengono memorizzati temporaneamente in una memoria tampone (buffer) fino a quando non possono essere elaborati. Tuttavia, un buffering eccessivo può introdurre latenza e ritardi nella trasmissione dei dati."
  },
  {
    "id": 23,
    "titolo": "Coda prioritaria nei router",
    "categoria": "QoS",
    "contenuto": "La coda prioritaria nei router è una tecnica di gestione del traffico che assegna priorità a determinati tipi di pacchetti, garantendo che i pacchetti critici vengano elaborati prima di quelli meno importanti. Questo approccio migliora le prestazioni delle applicazioni sensibili alla latenza, come VoIP e video in streaming."
  },
  {
    "id": 24,
    "titolo": "QoS e MPLS",
    "categoria": "QoS",
    "contenuto": "La QoS in un contesto MPLS (Multiprotocol Label Switching) è fondamentale per garantire prestazioni affidabili e prevedibili per applicazioni e servizi. MPLS consente di implementare politiche QoS attraverso la classificazione, la marcatura e la gestione del traffico, migliorando l'efficienza della rete."
  },
  {
    "id": 25,
    "titolo": "Congestione e QoS",
    "categoria": "QoS",
    "contenuto": "La congestione e la QoS sono strettamente correlate, poiché una gestione efficace della QoS può prevenire la congestione nella rete. Implementando politiche QoS, i router possono garantire che il traffico critico riceva le risorse necessarie, riducendo il rischio di congestione e migliorando le prestazioni complessive della rete."
  },
  {
    "id": 26,
    "titolo": "Caching HTTP",
    "categoria": "HTTP",
    "contenuto": "Il caching HTTP consiste nel memorizzare temporaneamente risposte HTTP per evitare richieste ripetute al server. Può avvenire nel browser, nei proxy o in CDN. È controllato tramite intestazioni come Cache-Control, Expires, ETag e Last-Modified. Migliora le prestazioni, riduce la latenza e alleggerisce il carico sui server."
  },
  {
    "id": 27,
    "titolo": "Proxy trasparenti e HTTPS",
    "categoria": "Sicurezza Reti",
    "contenuto": "I proxy trasparenti intercettano il traffico senza configurazioni lato client. Tuttavia, con HTTPS, non possono ispezionare i dati perché tutto è cifrato. Per farlo, usano tecniche di SSL interception: si installa un certificato CA sul client e il proxy decifra e ricifra il traffico. Questo approccio permette il filtraggio ma comporta rischi di sicurezza, violazioni della privacy e incompatibilità con tecnologie moderne come TLS 1.3 con ESNI."
  },
  {
    "id": 28,
    "titolo": "CDN URL-Based Routing",
    "categoria": "CDN",
    "contenuto": "L'URL-based routing nelle CDN è una tecnica che permette di instradare il traffico in base a parti specifiche dell'URL, come path, estensione o query string. In base all'analisi dell'URL, la CDN può decidere quale cache usare, se inoltrare la richiesta all'origine, o applicare politiche differenti per contenuti statici e dinamici. Questo approccio consente ottimizzazione delle prestazioni, controllo granulare e personalizzazione della distribuzione dei contenuti."
  },
  {
    "id": 29,
    "titolo": "Ethernet: Panoramica Generale",
    "categoria": "Ethernet",
    "contenuto": "Ethernet è una tecnologia di rete LAN che utilizza frame per trasmettere dati. Lavora tipicamente a livello 2 (data link) del modello OSI e utilizza indirizzamento MAC per identificare i dispositivi sulla rete."
  },
  {
    "id": 30,
    "titolo": "Frame Ethernet",
    "categoria": "Ethernet",
    "contenuto": "Il frame Ethernet standard include preambolo, indirizzi MAC sorgente/destinazione, tipo/length, dati e FCS. La lunghezza massima di un frame è 1518 byte (senza tag VLAN)."
  },
  {
    "id": 31,
    "titolo": "Switching Ethernet",
    "categoria": "Ethernet",
    "contenuto": "Gli switch Ethernet operano al livello 2 e usano MAC address learning e switching table per inoltrare i frame. Supportano tecniche come store-and-forward e cut-through switching."
  },
  {
    "id": 33,
    "titolo": "Protocolli di Ethernet",
    "categoria": "Ethernet",
    "contenuto": "Ethernet si basa principalmente su IEEE 802.3. I protocolli correlati includono ARP (per mappare IP a MAC), STP/RSTP/MSTP per prevenire loop, e LLDP per la discovery di dispositivi."
  },
  {
    "id": 34,
    "titolo": "Ethernet e VLAN",
    "categoria": "Ethernet",
    "contenuto": "Le VLAN (IEEE 802.1Q) permettono di segmentare reti Ethernet logiche su una singola infrastruttura fisica. Ogni frame include un VLAN tag a 4 byte per identificare la VLAN di appartenenza."
  },
  {
    "id": 35,
    "titolo": "VLAN Trunking",
    "categoria": "Ethernet",
    "contenuto": "Il trunking consente a più VLAN di condividere un singolo link fisico tra switch o router. Ogni frame Ethernet viene marcato con un VLAN tag (IEEE 802.1Q) che include un VLAN ID (VID) a 12 bit. Quando un frame attraversa un trunk, lo switch inserisce il tag 802.1Q tra l'intestazione MAC e il campo EtherType. Le porte trunk trasportano frame tagged di più VLAN, mentre le porte access trasportano solo frame untagged per una singola VLAN. I dispositivi finali non vedono i tag: lo switch li inserisce e li rimuove in ingresso/uscita. Un trunk permette l’estensione di più VLAN tra dispositivi mantenendo l’isolamento logico del traffico."
  },
  {
    "id": 36,
    "titolo": "Ethernet: Autonegotiation e Duplex",
    "categoria": "Ethernet",
    "contenuto": "L'autonegotiation consente ai dispositivi Ethernet di selezionare automaticamente la velocità e la modalità duplex (half/full). Full duplex elimina le collisioni e consente la trasmissione bidirezionale simultanea."
  },
  {
    "id": 37,
    "titolo": "Collision Domain e Broadcast Domain",
    "categoria": "Ethernet",
    "contenuto": "Ogni porta di uno switch rappresenta un collision domain separato. Tutte le porte, salvo configurazioni VLAN, fanno parte dello stesso broadcast domain."
  },
  {
    "id": 38,
    "titolo": "Protocollo CSMA/CD",
    "categoria": "Ethernet",
    "contenuto": "CSMA/CD (Carrier Sense Multiple Access with Collision Detection) è un protocollo usato in Ethernet half-duplex per gestire l'accesso al mezzo condiviso. Il dispositivo ascolta il canale (carrier sense); se libero, trasmette. Se due dispositivi trasmettono contemporaneamente, avviene una collisione. Entrambi rilevano l'errore (collision detection), interrompono la trasmissione, inviano un jamming signal, e attendono un intervallo casuale (backoff) prima di ritentare. L'efficienza cala con l'aumentare del traffico. Non è utilizzato in Ethernet full-duplex o in reti switchate moderne."
  },
  {
    "id": 39,
    "titolo": "Spanning Tree Protocol (STP)",
    "categoria": "Ethernet",
    "contenuto": "STP (IEEE 802.1D) previene loop nei domini broadcast. Gli switch eleggono un Root Bridge e disabilitano i percorsi ridondanti secondo l'algoritmo spanning tree (BPDU, costi di path, port roles/states)."
  },
  {
    "id": 40,
    "titolo": "Rapid Spanning Tree Protocol (RSTP)",
    "categoria": "Ethernet",
    "contenuto": "RSTP (IEEE 802.1w) è un'evoluzione di STP che consente tempi di convergenza inferiori a 1 secondo. Utilizza BPDU attivi e meccanismi di handshake (proposal/agree) per abilitare porte più velocemente. I ruoli delle porte includono: Root Port (RP), Designated Port (DP), Alternate Port (backup della RP) e Backup Port (backup su stesso segmento della DP). Gli stati delle porte sono ridotti a: Discarding, Learning, e Forwarding. È retrocompatibile con STP, quindi si adatta automaticamente se rileva dispositivi non RSTP sulla rete."
  },
  {
    "id": 41,
    "titolo": "IEEE 802.3ad – Link Aggregation (LACP)",
    "categoria": "Ethernet",
    "contenuto": "Consente di aggregare più link fisici in un'unica interfaccia logica. LACP (Link Aggregation Control Protocol) gestisce la negoziazione automatica dei link. Fornisce load balancing e fault tolerance."
  },
  {
    "id": 42,
    "titolo": "ARP – Address Resolution Protocol",
    "categoria": "Ethernet",
    "contenuto": "Protocollo a livello 2, usato per risolvere indirizzi IPv4 in indirizzi MAC. I pacchetti ARP sono encapsulati in frame Ethernet con EtherType 0x0806. Include ARP Request e ARP Reply."
  },
  {
    "id": 43,
    "titolo": "Port-Based VLAN vs MAC-Based VLAN",
    "categoria": "Ethernet",
    "contenuto": "Le VLAN basate su porta assegnano la VLAN in base alla porta fisica. Le VLAN basate su MAC assegnano i frame a VLAN diverse in base all'indirizzo MAC sorgente, indipendentemente dalla porta."
  },
  {
    "id": 44,
    "titolo": "Ethernet Flow Control (IEEE 802.3x)",
    "categoria": "Ethernet",
    "contenuto": "Utilizza frame PAUSE per rallentare il flusso di dati tra dispositivi full-duplex. Consente di prevenire la perdita di frame in condizioni di congestione buffer nei dispositivi riceventi."
  },
  {
    "id": 45,
    "titolo": "Tagged vs Untagged VLAN Frames",
    "categoria": "Ethernet",
    "contenuto": "I frame tagged includono un header 802.1Q con ID VLAN. I frame untagged sono frame Ethernet standard. Le porte possono essere access (untagged), trunk (tagged), o hybrid (entrambi)."
  },
  {
    "id": 46,
    "titolo": "IPv6 Privacy Extensions (RFC 4941)",
    "categoria": "IPv6",
    "contenuto": "L'RFC 4941 introduce un meccanismo di autoconfigurazione IPv6 che protegge la privacy generando indirizzi temporanei. Ogni indirizzo è composto da un prefisso, fornito dal router tramite Router Advertisement, e da un ID di interfaccia. A differenza del metodo standard che usa l’indirizzo MAC per creare l’ID (EUI-64), RFC 4941 impone la generazione di un ID casuale. L'host può quindi creare indirizzi temporanei che cambiano nel tempo, impedendo il tracciamento dell’utente. Il prefisso resta fisso, perché rappresenta la rete, mentre solo l'ID di interfaccia è non tracciabile."
  },
  {
    "id": 47,
    "titolo": "Struttura di un indirizzo IPv4",
    "categoria": "IPv4",
    "contenuto": "Un indirizzo IPv4 è composto da 32 bit, divisi in quattro ottetti in notazione decimale puntata. La parte rete identifica la subnet, mentre la parte host identifica il singolo dispositivo."
  },
  {
    "id": 48,
    "titolo": "Indirizzi speciali IPv4",
    "categoria": "IPv4",
    "contenuto": "Alcuni indirizzi IPv4 hanno significato riservato: 127.0.0.1 (loopback), 255.255.255.255 (broadcast limitato), x.x.x.0 (network ID), x.x.x.255 (broadcast diretto)."
  },
  {
    "id": 49,
    "titolo": "Network ID e Broadcast",
    "categoria": "IPv4",
    "contenuto": "Ogni subnet IPv4 riserva il primo indirizzo per il network ID (host bits = 0) e l'ultimo per il broadcast (host bits = 1), non assegnabili a host."
  },
  {
    "id": 50,
    "titolo": "Classi IP storiche",
    "categoria": "IPv4",
    "contenuto": "Gli indirizzi IPv4 erano divisi in classi: A (0–127), B (128–191), C (192–223). Ogni classe ha capacità diverse in termini di host e subnet."
  },
  {
    "id": 51,
    "titolo": "Limiti del sistema a classi",
    "categoria": "IPv4",
    "contenuto": "Il sistema a classi IP spreca indirizzi, non è flessibile e non permette subnetting efficiente, motivo per cui è stato superato da CIDR."
  },
  {
    "id": 52,
    "titolo": "Notazione CIDR",
    "categoria": "IPv4",
    "contenuto": "CIDR usa notazione IP/prefisso (es. 192.168.0.0/24) per rappresentare la dimensione della rete. Sostituisce le classi rigide con subnet flessibili."
  },
  {
    "id": 53,
    "titolo": "Netmask valida",
    "categoria": "IPv4",
    "contenuto": "Una netmask valida è una sequenza di 1 seguiti da 0 (es. 255.255.255.0). Non può contenere 1 dopo uno 0."
  },
  {
    "id": 54,
    "titolo": "CIDR: host disponibili",
    "categoria": "IPv4",
    "contenuto": "In CIDR, gli host disponibili si calcolano come 2^(32 - prefix) - 2. Ad esempio: /24 → 254 host utilizzabili."
  },
  {
    "id": 55,
    "titolo": "Subnetting IPv4",
    "categoria": "IPv4",
    "contenuto": "Il subnetting suddivide una rete IP in più sottoreti. Ogni subnet ha un suo network ID, broadcast e host validi."
  },
  {
    "id": 56,
    "titolo": "Subnet /24, /26, /30",
    "categoria": "IPv4",
    "contenuto": "Esempi: /24 = 254 host, /26 = 62 host, /30 = 2 host. Usati per reti grandi, medie, punto-punto."
  },
  {
    "id": 57,
    "titolo": "VLSM – Variable Length Subnet Masking",
    "categoria": "IPv4",
    "contenuto": "Il VLSM consente subnet di dimensioni diverse all’interno della stessa rete, ottimizzando l’uso degli indirizzi."
  },
  {
    "id": 58,
    "titolo": "Aggregazione IP",
    "categoria": "IPv4",
    "contenuto": "Due subnet sono aggregabili se condividono lo stesso prefisso iniziale e differiscono solo per un bit nel resto."
  },
  {
    "id": 59,
    "titolo": "Aggregazione di rotte statiche e dinamiche vs dirette",
    "categoria": "IPv4",
    "contenuto": "Le rotte statiche e dinamiche possono essere aggregate se sono contigue e condividono lo stesso prefisso iniziale. Ad esempio, le rotte 192.168.0.0/24 e 192.168.1.0/24 possono essere aggregate in un'unica rotta 192.168.0.0/23. Questo riduce la dimensione della tabella di routing. Le rotte dirette invece non possono essere aggregate perché sono associate a interfacce fisiche specifiche. Ogni interfaccia di rete genera una rotta diretta autonoma, legata alla topologia fisica, e non può essere combinata con altre, anche se le reti sono contigue."
  },
  {
    "id": 60,
    "titolo": "Esempio di aggregazione",
    "categoria": "IPv4",
    "contenuto": "192.168.0.0/24 e 192.168.1.0/24 possono essere aggregate in 192.168.0.0/23."
  },
  {
    "id": 61,
    "titolo": "Funzionamento ARP",
    "categoria": "IPv4",
    "contenuto": "ARP traduce un indirizzo IP in MAC. L’host invia un ARP Request in broadcast, e riceve un ARP Reply in unicast con il MAC associato."
  },
  {
    "id": 62,
    "titolo": "ARP nel ping",
    "categoria": "IPv4",
    "contenuto": "Quando un host pinga un altro sulla stessa subnet, prima invia ARP per scoprire il MAC del destinatario, poi invia ICMP Echo."
  },
  {
    "id": 63,
    "titolo": "ARP table",
    "categoria": "IPv4",
    "contenuto": "Gli host memorizzano le corrispondenze IP↔MAC in una ARP table temporanea, per evitare richieste ripetute."
  },
  {
    "id": 64,
    "titolo": "NAT – Network Address Translation",
    "categoria": "IPv4",
    "contenuto": "NAT traduce indirizzi IP privati in uno o più IP pubblici. Usato per far accedere host privati a Internet."
  },
  {
    "id": 65,
    "titolo": "PAT – Port Address Translation",
    "categoria": "IPv4",
    "contenuto": "Il PAT consente a molti host privati di condividere un solo IP pubblico, usando porte TCP/UDP differenti."
  },
  {
    "id": 66,
    "titolo": "Motivazione uso NAT/PAT",
    "categoria": "IPv4",
    "contenuto": "NAT/PAT affrontano il problema della scarsità di IPv4 pubblici, migliorano la sicurezza e l’isolamento delle reti locali."
  },
  {
    "id": 67,
    "titolo": "Funzione del DHCP",
    "categoria": "IPv4",
    "contenuto": "Il DHCP assegna automaticamente IP, netmask, gateway e DNS a un host al momento della connessione. Il client sceglie una delle offerte e invia un messaggio broadcast per richiedere formalmente l’IP scelte"
  },
  {
    "id": 68,
    "titolo": "Fasi del DHCP",
    "categoria": "IPv4",
    "contenuto": "Il processo DHCP include: Discover → Offer → Request → Ack. È usato per l’autoconfigurazione client."
  },
  {
    "id": 69,
    "titolo": "Vantaggi del DHCP",
    "categoria": "IPv4",
    "contenuto": "Riduce configurazioni manuali, previene errori e supporta il riassegnamento dinamico degli IP disponibili."
  },
  {
    "id": 70,
    "titolo": "Routing diretto e indiretto",
    "categoria": "IPv4",
    "contenuto": "Se l’host di destinazione è nella stessa subnet, l’invio è diretto. Altrimenti, si invia al router (default gateway)."
  },
  {
    "id": 71,
    "titolo": "Next Hop",
    "categoria": "IPv4",
    "contenuto": "Il next hop è l'indirizzo del router a cui inoltrare un pacchetto se la rete di destinazione non è direttamente connessa."
  },
  {
    "id": 72,
    "titolo": "Longest Prefix Match",
    "categoria": "IPv4",
    "contenuto": "Quando più rotte sono compatibili, il router sceglie quella con il prefisso più lungo (più specifica) nella tabella di routing."
  },
  {
    "id": 73,
    "titolo": "Struttura dell'indirizzo IPv6",
    "categoria": "IPv6",
    "contenuto": "Un indirizzo IPv6 è lungo 128 bit, rappresentato in 8 gruppi esadecimali separati da due punti. La struttura tipica è composta da un prefisso di rete e un ID di interfaccia. La notazione può essere abbreviata omettendo zeri iniziali e gruppi consecutivi di zeri (::)."
  },
  {
    "id": 74,
    "titolo": "Tipi di indirizzi IPv6",
    "categoria": "IPv6",
    "contenuto": "IPv6 definisce diversi tipi di indirizzi: Unicast (comunicazione uno-a-uno), Multicast (uno-a-molti), Anycast (uno-a-il più vicino). Inoltre, esistono indirizzi speciali come Link-local (FE80::/10), Unique Local Addresses (FD00::/8), Loopback (::1) e Unspecified (::)."
  },
  {
    "id": 75,
    "titolo": "Indirizzi Multicast IPv6",
    "categoria": "IPv6",
    "contenuto": "Gli indirizzi multicast IPv6 iniziano con il prefisso FF00::/8 e sono utilizzati per inviare pacchetti a più destinatari. Questi indirizzi sono mappati su indirizzi MAC con prefisso 33:33, seguiti dagli ultimi 32 bit dell'indirizzo IPv6."
  },
  {
    "id": 76,
    "titolo": "Solicited-Node Multicast Address",
    "categoria": "IPv6",
    "contenuto": "Ogni dispositivo IPv6 calcola un indirizzo multicast specifico, chiamato Solicited-Node Multicast Address, utilizzato dal Neighbor Discovery Protocol per la risoluzione degli indirizzi. Questo indirizzo ha il prefisso FF02::1:FF00:0/104 combinato con gli ultimi 24 bit dell'indirizzo IPv6 del nodo."
  },
  {
    "id": 77,
    "titolo": "Neighbor Discovery Protocol (NDP)",
    "categoria": "IPv6",
    "contenuto": "Il Neighbor Discovery Protocol (NDP) è il meccanismo base di IPv6 per scoprire nodi e router nella rete locale. Sostituisce ARP e altri protocolli IPv4 usando messaggi ICMPv6. Le sue funzioni includono: risoluzione MAC (NS/NA), scoperta router (RS/RA), rilevamento di indirizzi duplicati (DAD) e verifica della raggiungibilità dei vicini. È più efficiente di ARP perché usa multicast anziché broadcast."
  },
  {
    "id": 78,
    "titolo": "ICMPv6: Tipi di messaggi",
    "categoria": "IPv6",
    "contenuto": "ICMPv6 gestisce messaggi di errore (tipi 1-4), messaggi informativi come Echo Request/Reply (128-129) e messaggi per il Neighbor Discovery Protocol (tipi 133-137)."
  },
  {
    "id": 79,
    "titolo": "IPv6 Extension Headers",
    "categoria": "IPv6",
    "contenuto": "Gli Extension Headers in IPv6 forniscono funzionalità opzionali come la frammentazione, la sicurezza e il routing. Alcuni esempi includono Hop-by-Hop Options, Routing Header, Fragment Header e Authentication Header."
  },
  {
    "id": 80,
    "titolo": "Configurazione degli indirizzi IPv6",
    "categoria": "IPv6",
    "contenuto": "Gli indirizzi IPv6 possono essere configurati manualmente, tramite SLAAC (Stateless Address Autoconfiguration) o DHCPv6. SLAAC consente ai dispositivi di autoconfigurarsi utilizzando le informazioni fornite dai Router Advertisement."
  },
  {
    "id": 81,
    "titolo": "Routing in IPv6",
    "categoria": "IPv6",
    "contenuto": "IPv6 supporta protocolli di routing come OSPFv3, RIPng e BGP. Le strategie di coesistenza con IPv4 includono il dual stack (gestione simultanea di IPv4 e IPv6) e l'uso di tunneling per la transizione."
  },
  {
    "id": 82,
    "titolo": "Convivenza IPv4-IPv6",
    "categoria": "IPv6",
    "contenuto": "IPv6 può coesistere con IPv4 tramite strategie come dual stack (IPv4+IPv6 simultanei), tunneling (traffico IPv6 incapsulato in IPv4), e NAT64/DNS64 per traduzione tra protocolli. Questi metodi garantiscono transizione graduale e compatibilità."
  },
  {
    "id": 83,
    "titolo": "Unique Local Addresses (ULA)",
    "categoria": "IPv6",
    "contenuto": "I Unique Local Addresses (ULA) sono indirizzi IPv6 privati, simili agli indirizzi IPv4 non pubblici. Appartengono al prefisso FD00::/8 e non sono instradabili su Internet. Sono usati per reti locali o interconnessioni private tra sedi, garantendo un uso interno sicuro e non conflittuale."
  },
  {
    "id": 84,
    "titolo": "Link-Local Addresses (IPv6)",
    "categoria": "IPv6",
    "contenuto": "Gli indirizzi link-local (FE80::/10) sono usati per comunicazioni locali tra dispositivi sulla stessa rete fisica. Sono generati automaticamente e necessari per protocolli come Neighbor Discovery e OSPFv3. Non possono attraversare router né essere instradati su reti diverse."
  },
  {
    "id": 85,
    "titolo": "RIB e FIB",
    "categoria": "Concetti Base",
    "contenuto": "La RIB (Routing Information Base) è generata dai protocolli di routing nel control plane. La FIB (Forwarding Information Base) è derivata dalla RIB ma ottimizzata per il data plane: è più veloce e usata direttamente per l'inoltro dei pacchetti."
  },
  {
    "id": 86,
    "titolo": "Control Plane vs Data Plane",
    "categoria": "Concetti Base",
    "contenuto": "Il control plane gestisce l'apprendimento e la scelta dei percorsi (routing). Il data plane esegue l'inoltro dei pacchetti in tempo reale (forwarding). I due piani sono separati per motivi di efficienza e sicurezza."
  },
  {
    "id": 87,
    "titolo": "Cos'è RIP",
    "categoria": "Protocollo di Routing",
    "contenuto": "RIP è un protocollo di routing dinamico basato su Distance Vector. Usa il numero di hop come metrica e ha un limite massimo di 15 hop, rendendolo inadatto a reti grandi. I pacchetti vengono aggiornati ogni 30 secondi."
  },
  {
    "id": 88,
    "titolo": "Funzionamento di RIP",
    "categoria": "Protocollo di Routing",
    "contenuto": "Ogni router RIP invia la sua routing table ai vicini a intervalli regolari. I router aggiornano la propria tabella sommando +1 agli hop ricevuti. Il next hop con hop minori viene selezionato per ogni destinazione."
  },
  {
    "id": 89,
    "titolo": "Limiti e problemi di RIP",
    "categoria": "Protocollo di Routing",
    "contenuto": "RIP soffre di lentezza nella convergenza, loop di routing, count-to-infinity e uso inefficiente della banda. Non supporta VLSM (nella versione 1) né sicurezza avanzata."
  },
  {
    "id": 90,
    "titolo": "RIP vs OSPF",
    "categoria": "Confronto Protocolli",
    "contenuto": "OSPF è superiore in tutto: supporta grandi reti, convergenza rapida, VLSM, aree gerarchiche e metriche flessibili. RIP è usato solo in reti legacy o semplici."
  },
  {
    "id": 91,
    "titolo": "Cos'è la FIB",
    "categoria": "Data Plane",
    "contenuto": "La FIB è una tabella usata nel piano dati dai router per determinare il next hop dei pacchetti in arrivo. È ottimizzata per velocità e contiene solo le informazioni necessarie per l'inoltro rapido."
  },
  {
    "id": 92,
    "titolo": "Come viene costruita la FIB",
    "categoria": "Data Plane",
    "contenuto": "La FIB è derivata dalla RIB (che contiene tutte le rotte conosciute). Il sistema operativo del router seleziona le rotte migliori e le inserisce nella FIB per l’inoltro efficiente. La sincronizzazione avviene in tempo reale."
  },
  {
    "id": 93,
    "titolo": "Ottimizzazioni della FIB",
    "categoria": "Data Plane",
    "contenuto": "La FIB è spesso implementata con strutture dati ad alte prestazioni (come trie compressi o hash tables). Permette look-up IP in pochi microsecondi, riducendo la latenza dell’instradamento."
  },
  {
    "id": 94,
    "titolo": "Differenze tra FIB e RIB",
    "categoria": "Confronto Tabelle",
    "contenuto": "La RIB è costruita dal control plane e contiene tutte le rotte (inclusi backup e policy). La FIB contiene solo le rotte attive e migliori, pronte per l’inoltro. La FIB è veloce, la RIB è completa."
  },
  {
    "id": 95,
    "titolo": "Label Switching (MPLS)",
    "categoria": "Tecniche",
    "contenuto": "In MPLS, ogni pacchetto ha una label che viene scambiata (label swapping) lungo il percorso. Non si guarda all’IP, il che velocizza il forwarding e permette l’ingegneria del traffico (Traffic Engineering)."
  },
  {
    "id": 96,
    "titolo": "Source Routing",
    "categoria": "Tecniche",
    "contenuto": "Nel source routing, il pacchetto contiene l’intero percorso scelto dalla sorgente. È raro perché richiede visibilità completa della topologia ed è vulnerabile a problemi di sicurezza e scalabilità."
  },
  {
    "id": 97,
    "titolo": "Reti Wireless e Mobili",
    "categoria": "Fondamenti",
    "contenuto": "Le reti wireless usano collegamenti radio; la mobilità implica la gestione del cambio di punto di accesso. Le reti 4G/5G usano IP e supportano SDN."
  },
  {
    "id": 98,
    "titolo": "Componenti di Rete Wireless",
    "categoria": "Architettura",
    "contenuto": "Include host wireless (mobili o fissi), stazioni base (AP, torri), e collegamenti radio. Modalità: infrastrutturata (via AP) o ad hoc (peer-to-peer)."
  },
  {
    "id": 99,
    "titolo": "Wi-Fi: Architettura IEEE 802.11",
    "categoria": "Wireless LAN",
    "contenuto": "Ogni Basic Service Set (BSS) comprende host e AP. In modalità ad hoc, la comunicazione avviene direttamente tra host."
  },
  {
    "id": 100,
    "titolo": "Wi-Fi: Associazione e Scansione",
    "categoria": "Wireless LAN",
    "contenuto": "Per connettersi a una rete Wi-Fi, un host deve prima trovare un Access Point (AP). Esistono due modalità di scansione: \n- Scansione passiva: l’AP trasmette periodicamente beacon con informazioni come SSID e MAC address; l’host ascolta questi beacon e sceglie a quale AP associarsi.\n- Scansione attiva: l’host invia una richiesta (probe request) su vari canali; ogni AP che la riceve risponde (probe response) con i propri dettagli.\nDopo aver scelto un AP, l’host invia una richiesta di associazione. Una volta accettata, avviene l’autenticazione e l’assegnazione dinamica dell’indirizzo IP tramite DHCP."
  },
  {
    "id": 101,
    "titolo": "CSMA/CA e RTS/CTS",
    "categoria": "MAC Protocols",
    "contenuto": "Il protocollo 802.11 utilizza CSMA/CA (Carrier Sense Multiple Access with Collision Avoidance) per evitare le collisioni nel mezzo condiviso. Poiché in Wi-Fi un dispositivo non può rilevare direttamente una collisione mentre trasmette, CSMA/CA tenta di prevenirle ascoltando il canale prima di trasmettere. Se il canale è libero, attende un breve tempo (DIFS), poi trasmette. In caso contrario, avvia un backoff casuale. Il meccanismo opzionale RTS/CTS (Request to Send / Clear to Send) viene usato per ridurre le collisioni causate dai nodi nascosti: il mittente invia un RTS e riceve un CTS dall’AP; tutti i nodi che sentono il CTS rimangono in silenzio, evitando interferenze durante la trasmissione."
  },
  {
    "id": 102,
    "titolo": "IEEE 802.11: Frame e Indirizzamento",
    "categoria": "MAC Protocols",
    "contenuto": "I frame del protocollo IEEE 802.11 (Wi-Fi) possono contenere fino a 4 indirizzi MAC per gestire diverse modalità di comunicazione. Questo consente flessibilità nel routing del frame, sia in reti infrastrutturate (con Access Point) sia in reti ad hoc (peer-to-peer). I 4 indirizzi servono a specificare: (1) il destinatario, (2) il mittente, (3) l’Access Point o router coinvolto nel forwarding, e (4) eventualmente un ulteriore nodo nelle reti ad hoc. Questa struttura consente di distinguere chiaramente tra chi ha generato il frame, chi lo deve ricevere e chi lo sta inoltrando nella rete."
  },
  {
    "id": 103,
    "titolo": "Reti Cellulari: Concetti Base",
    "categoria": "Cellulari",
    "contenuto": "Le celle coprono aree geografiche. I terminali si muovono tra celle tramite handover - la connessione resta attiva-, collegandosi a quella con miglior segnale."
  },
  {
    "id": 104,
    "titolo": "Tecniche di Accesso Multiplo",
    "categoria": "Cellulari",
    "contenuto": "FDMA, TDMA, CDMA, SDMA: permettono a più utenti di condividere le risorse radio in modo efficiente."
  },
  {
    "id": 105,
    "titolo": "Gestione della Mobilità",
    "categoria": "Mobilità",
    "contenuto": "Include location update, paging, handover (soft/hard, intra/inter-cell, MT/BS-initiated)."
  },
  {
    "id": 106,
    "titolo": "GSM: Architettura",
    "categoria": "2G",
    "contenuto": "Composta da MS, SIM, BSS (BTS+BSC), NSS (MSC, HLR, VLR, AUC). Fornisce servizi voce, SMS e gestione mobilità."
  },
  {
    "id": 107,
    "titolo": "LTE: Architettura e Bearers",
    "categoria": "4G",
    "contenuto": "E-UTRAN con eNodeB e EPC (MME, SGW, PGW, HSS). Usa bearer (default e dedicati) per trasporto dati IP con QoS."
  },
  {
    "id": 108,
    "titolo": "5G: Architettura e Funzionalità",
    "categoria": "5G",
    "contenuto": "Core modulare con SBA, RAN con gNB, slicing, edge computing. NF come AMF, SMF, UPF gestiscono accesso, sessioni, traffico."
  },
  {
    "id": 109,
    "titolo": "Multiaccess Edge Computing (MEC)",
    "categoria": "5G",
    "contenuto": "Server e risorse spostati vicino agli utenti (antenne/router) per ridurre latenza. Supporta applicazioni locali e IoT."
  },
  {
    "id": 110,
    "titolo": "Indirizzi fondamentali IPv6",
    "categoria": "IPv6",
    "contenuto": "IPv6 usa indirizzi Link-local (FE80::/10), Global Unicast (2000::/3), Unique Local (FD00::/8), Multicast (FF00::/8), Anycast (senza prefisso dedicato), Loopback (::1) e Unspecified (::). Nessun broadcast: sostituito da multicast e anycast."
  },
  {
    "id": 111,
    "titolo": "Funzionamento di IPsec",
    "categoria": "Sicurezza",
    "contenuto": "IPsec protegge i dati a livello IP tramite due protocolli: AH (Authentication Header) e ESP (Encapsulating Security Payload). Opera in modalità transport (solo payload cifrato) o tunnel (intero pacchetto IP cifrato). Utilizza IKE per lo scambio delle chiavi. Ha problemi con NAT perché modifica gli header IP e i checksum, rompendo l'integrità dei pacchetti verificata da IPsec, specialmente con AH che protegge anche gli header IP."
  },
  {
    "id": 112,
    "titolo": "Standard UMTS",
    "categoria": "Reti Mobili",
    "contenuto": "UMTS (Universal Mobile Telecommunications System) è uno standard 3G basato su W-CDMA. Supporta servizi voce e dati con velocità maggiori rispetto al 2G. Introdotti concetti come RNC, macro/microdiversity e handover soft."
  },
  {
    "id": 113,
    "titolo": "Protocollo PPTP",
    "categoria": "VPN",
    "contenuto": "PPTP (Point-to-Point Tunneling Protocol) è un protocollo usato per creare VPN di accesso remoto. Usa GRE per incapsulare il traffico PPP. È semplice e supportato nativamente, ma ha problemi di sicurezza noti. Non adatto a VPN moderne."
  },
  {
    "id": 114,
    "titolo": "Multicast in IPv4",
    "categoria": "IPv4",
    "contenuto": "Il multicast permette di inviare dati a più destinatari selezionati usando un solo flusso. In IPv4 è possibile, ma richiede protocolli aggiuntivi come IGMP per la gestione dei gruppi e PIM per l'inoltro tra router. Non funziona automaticamente senza questi."
  },
  {
    "id": 115,
    "titolo": "Cos'è una CDN",
    "categoria": "CDN",
    "contenuto": "Una Content Delivery Network (CDN) è una rete distribuita di server vicini agli utenti finali. Ospita copie dei contenuti per ridurre la latenza, migliorare le prestazioni, scaricare i server centrali e ottimizzare i costi."
  },
  {
    "id": 116,
    "titolo": "Funzionamento delle CDN",
    "categoria": "CDN",
    "contenuto": "Le CDN replicano i contenuti su server distribuiti in data center o ISP. Quando un utente fa una richiesta, viene indirizzato alla replica più vicina o meno carica, migliorando velocità e affidabilità."
  },
  {
    "id": 117,
    "titolo": "Vantaggi delle CDN",
    "categoria": "CDN",
    "contenuto": "CDN migliorano velocità (bassa latenza), affidabilità (replica e failover), scalabilità (milioni di utenti), controllo del provider e supportano anche contenuti dinamici, streaming e pubblicità localizzata."
  },
  {
    "id": 118,
    "titolo": "Confronto CDN vs Proxy Cache",
    "categoria": "CDN",
    "contenuto": "Le cache sono reattive, locali e senza controllo del provider. Le CDN sono proattive, distribuite e permettono pieno controllo. Le CDN migliorano la QoS, le cache riducono solo il traffico ISP."
  },
  {
    "id": 119,
    "titolo": "Replica dei contenuti nelle CDN",
    "categoria": "CDN",
    "contenuto": "Il provider aggiorna i contenuti e la CDN li propaga alle repliche. Le sfide principali sono: dove replicare, quanto replicare, come aggiornare e come selezionare la replica ottimale."
  },
  {
    "id": 120,
    "titolo": "Caso Akamai",
    "categoria": "CDN",
    "contenuto": "Akamai usa domini specifici per ogni cliente. I contenuti sono organizzati in gruppi e le URL del provider vengono riscritte per indirizzare le richieste alla rete CDN di Akamai."
  },
  {
    "id": 121,
    "titolo": "Limiti delle CDN",
    "categoria": "CDN",
    "contenuto": "Le CDN introducono latenza se usano HTTP redirect. Le URL-based CDN sono più precise ma richiedono terminazione TCP. Alcuni contenuti (es. aggiornamenti frequenti) sono difficili da replicare."
  },
  {
    "id": 122,
    "titolo": "Conclusione sulle CDN",
    "categoria": "CDN",
    "contenuto": "Le CDN sono essenziali per distribuire contenuti globalmente in modo veloce e affidabile. Utilizzate da grandi piattaforme per siti web, streaming, pubblicità e contenuti dinamici."
  },
  {
    "id": 123,
    "titolo": "Applicazioni multimediali in rete",
    "categoria": "QoS",
    "contenuto": "App real-time come videoconferenze, giochi online e realtà virtuale richiedono flussi continui, interattività elevata, alta banda e comunicazioni uno-a-molti o molti-a-molti."
  },
  {
    "id": 124,
    "titolo": "Requisiti delle applicazioni multimediali",
    "categoria": "QoS",
    "contenuto": "Voce <150ms, Tactile Internet <1ms. Serve bassa latenza, ritardo stabile, alta disponibilità di banda e risorse nei nodi."
  },
  {
    "id": 125,
    "titolo": "Classificazione e Scheduling dei pacchetti",
    "categoria": "QoS",
    "contenuto": "Classificazione su 5-tuple. Code: FIFO, Priority Queue, Round Robin, WFQ, Deadline Queuing. Serve a gestire il traffico e rispettare vincoli di QoS."
  },
  {
    "id": 126,
    "titolo": "Gestione delle code nello switching",
    "categoria": "QoS",
    "contenuto": "Output Queuing è semplice ma limitato. Input Queuing con speed-up migliora le prestazioni. Code virtuali distribuite sono più efficienti ma complesse."
  },
  {
    "id": 127,
    "titolo": "RSVP – Resource Reservation Protocol",
    "categoria": "QoS",
    "contenuto": "RSVP prenota risorse per flussi IP. Usa messaggi PATH e RESV per stabilire QoS. Funziona con IntServ. È poco scalabile, usato solo in reti controllate."
  },
  {
    "id": 128,
    "titolo": "Controllo del traffico",
    "categoria": "QoS",
    "contenuto": "Policing scarta o declassa, shaping ritarda i pacchetti. A livello di flusso si usa CAC. A livello di rete si applica traffic engineering con bilanciamento e monitoraggio."
  },
  {
    "id": 129,
    "titolo": "QoS Routing",
    "categoria": "QoS",
    "contenuto": "Il routing QoS cerca percorsi che rispettano banda, ritardo, perdita. Funziona con reti a segnalazione (es. ATM). Esempi: crankback, PNNI."
  },
  {
    "id": 130,
    "titolo": "IntServ vs DiffServ",
    "categoria": "QoS",
    "contenuto": "IntServ prenota risorse per ogni flusso (RSVP): alta qualità ma poca scalabilità. DiffServ classifica pacchetti per priorità: più semplice, veloce e scalabile."
  },
  {
    "id": 131,
    "titolo": "Expedited Forwarding (EF)",
    "categoria": "QoS",
    "contenuto": "Classe DiffServ ad alta priorità (DSCP 46) per VoIP, videoconferenze, applicazioni critiche. Garantisce bassa latenza e jitter tramite code prioritarie."
  },
  {
    "id": 132,
    "titolo": "Assured Forwarding (AF)",
    "categoria": "QoS",
    "contenuto": "Classe DiffServ con 4 classi e 3 livelli di drop precedence. Fornisce affidabilità media per traffico importante ma non critico. Esempi: AF11, AF43."
  },
  {
    "id": 133,
    "titolo": "Cos'è una VPN",
    "categoria": "VPN",
    "contenuto": "Una VPN (Virtual Private Network) crea un canale sicuro tra dispositivi remoti e una rete privata. Può operare su Layer 2, 3 o 4 e garantire autenticazione, cifratura e integrità del traffico."
  },
  {
    "id": 134,
    "titolo": "Tipi di VPN",
    "categoria": "VPN",
    "contenuto": "Site-to-Site collega sedi aziendali. Remote Access collega un utente singolo. End-to-End collega due dispositivi. Possono essere basate su Layer 2 (Ethernet), Layer 3 (IPsec/MPLS), o Layer 4 (SSL/TLS)."
  },
  {
    "id": 135,
    "titolo": "VPN Layer 2 vs Layer 3",
    "categoria": "VPN",
    "contenuto": "L2 VPN incapsula frame Ethernet e il routing è gestito dal cliente (es. VPLS, VPWS). L3 VPN incapsula pacchetti IP e il routing è gestito dal provider tramite VRF (es. MPLS L3VPN)."
  },
  {
    "id": 136,
    "titolo": "MPLS VPN Layer 3",
    "categoria": "MPLS VPN",
    "contenuto": "Basata su PE/CE, VRF e MP-BGP. I pacchetti sono instradati tramite etichette MPLS. Supporta QoS, è scalabile e separa logicamente i clienti, ma non cifra il traffico."
  },
  {
    "id": 137,
    "titolo": "Overlay vs Peer VPN",
    "categoria": "VPN",
    "contenuto": "Overlay: il cliente gestisce il routing (tipico L2VPN). Peer: client e provider scambiano rotte (es. BGP CE-PE). Peer VPN richiede maggiore cooperazione e configurazione condivisa."
  },
  {
    "id": 138,
    "titolo": "Modelli VPN: Customer vs Provider Provisioned",
    "categoria": "VPN",
    "contenuto": "Customer Provisioned: tunnel gestito dal cliente. Provider Provisioned: gestito dal provider. Il primo è flessibile ma complesso, il secondo è semplice ma centralizzato."
  },
  {
    "id": 139,
    "titolo": "Tunneling VPN Layer 4",
    "categoria": "VPN",
    "contenuto": "Site-to-Site Layer 4: tunnel tra gateway (es. IPsec su UDP). End-to-End Layer 4: tra host, tipico con SSL VPN. Usato per accessi remoti e comunicazioni sicure tra dispositivi."
  },
  {
    "id": 140,
    "titolo": "GRE – Generic Routing Encapsulation",
    "categoria": "VPN",
    "contenuto": "Protocollo di incapsulamento generico usato per trasportare pacchetti IP e non-IP in tunnel IP. Supporta sequenze, ACK, flow control, e viene usato in PPTP e altre VPN."
  },
  {
    "id": 141,
    "titolo": "PPTP – Point-to-Point Tunneling Protocol",
    "categoria": "VPN",
    "contenuto": "VPN obsoleta che incapsula PPP in IP usando GRE e TCP/1723. Facile da configurare ma con crittografia debole (MPPE) e protocolli vulnerabili (MS-CHAP)."
  },
  {
    "id": 142,
    "titolo": "IPsec – IP Security",
    "categoria": "Sicurezza",
    "contenuto": "Protegge traffico IP con AH (autenticazione) o ESP (cifratura + integrità). Usa IKE per negoziare parametri e creare tunnel sicuri. Funziona in transport o tunnel mode."
  },
  {
    "id": 143,
    "titolo": "Limitazioni IPsec",
    "categoria": "Sicurezza",
    "contenuto": "IPsec è potente ma complesso, non funziona bene con NAT a meno di NAT-T, e richiede configurazioni dettagliate tra peer. Adatto a scenari aziendali stabili."
  },
  {
    "id": 144,
    "titolo": "VPN SSL",
    "categoria": "VPN",
    "contenuto": "Usa SSL/TLS su TCP/443. Facile da usare, compatibile con NAT/firewall. Può essere clientless (web) o full tunnel (es. AnyConnect). Offre crittografia, autenticazione e integrità."
  },
  {
    "id": 145,
    "titolo": "VPN MPLS – Layer 2 e Layer 3",
    "categoria": "MPLS VPN",
    "contenuto": "MPLS VPN L2 (VPLS, VPWS) trasporta frame Ethernet. MPLS VPN L3 trasporta pacchetti IP con VRF. Scalabili, isolati logicamente, usati per collegare sedi aziendali tramite rete del provider."
  },
  {
    "id": 146,
    "titolo": "Architetture VPN MPLS",
    "categoria": "MPLS VPN",
    "contenuto": "MPLS/BGP VPN usa MP-BGP e Route Distinguisher per isolamento. Virtual Router VPN isola ogni cliente con router virtuali distinti su PE. Entrambe permettono indirizzi IP duplicati."
  },
  {
    "id": 147,
    "titolo": "Cos'è MPLS",
    "categoria": "MPLS",
    "contenuto": "MPLS (Multiprotocol Label Switching) usa etichette per instradare pacchetti in modo veloce. Lavora tra livello 2 e 3 (Layer 2.5) e supporta QoS, VPN e traffic engineering."
  },
  {
    "id": 148,
    "titolo": "Label Switch Path (LSP)",
    "categoria": "MPLS",
    "contenuto": "Percorso unidirezionale stabilito tra router MPLS. I pacchetti seguono lo stesso LSP sulla base della FEC (Forwarding Equivalence Class)."
  },
  {
    "id": 149,
    "titolo": "MPLS Header",
    "categoria": "MPLS",
    "contenuto": "Include: label (20 bit), class bits (QoS), S-bit (bottom of stack), TTL. È inserito tra layer 2 e 3, evita IP lookup a ogni hop."
  },
  {
    "id": 150,
    "titolo": "Label Binding e Distribuzione",
    "categoria": "MPLS",
    "contenuto": "Label Binding: assegnazione label a una FEC. Static (manuale), Dynamic (automatico), Control-driven (guidato da topologia)."
  },
  {
    "id": 151,
    "titolo": "Protocolli di distribuzione label",
    "categoria": "MPLS",
    "contenuto": "LDP: semplice e automatico. RSVP-TE: supporta vincoli (QoS). BGP: usato in VPN MPLS. I protocolli sono mutuamente esclusivi sulla stessa LSP."
  },
  {
    "id": 152,
    "titolo": "Routing MPLS",
    "categoria": "MPLS",
    "contenuto": "Usa OSPF, IS-IS, BGP per costruire topologia. Supporta routing hop-by-hop o esplicito (con RSVP-TE, Segment Routing)."
  },
  {
    "id": 153,
    "titolo": "Traffic Engineering in MPLS",
    "categoria": "MPLS",
    "contenuto": "Permette gestione intelligente del traffico (QoS, bilanciamento carico). Usa CR-LDP, RSVP-TE, OSPF-TE, IS-IS-TE per percorsi con vincoli."
  },
  {
    "id": 154,
    "titolo": "QoS e CoS in MPLS",
    "categoria": "MPLS",
    "contenuto": "CoS classifica pacchetti, QoS garantisce priorità, banda e latenza. MPLS consente LSP separati con priorità diverse."
  },
  {
    "id": 155,
    "titolo": "Fast Fault Recovery",
    "categoria": "MPLS",
    "contenuto": "MPLS supporta backup LSP e riconfigurazione locale. Ripristino sub-50ms essenziale per traffico sensibile come VoIP."
  },
  {
    "id": 156,
    "titolo": "Penultimate Hop Popping (PHP)",
    "categoria": "MPLS",
    "contenuto": "Il penultimo router rimuove la label MPLS per alleggerire il carico sul router di uscita (egress LER)."
  },
  {
    "id": 157,
    "titolo": "MPLS VPN e label stack",
    "categoria": "MPLS VPN",
    "contenuto": "VPN MPLS usa due label: outer (per instradamento MPLS) e inner (per identificare la VPN). Permette separazione logica tra clienti senza usare crittografia."
  },
  {
    "id": 158,
    "titolo": "SDN - Software Defined Networking",
    "categoria": "SDN",
    "contenuto": "Separazione tra control plane (centralizzato) e data plane (switch semplificati). Controller gestisce dinamicamente le regole di instradamento tramite protocollo OpenFlow."
  },
  {
    "id": 159,
    "titolo": "OpenFlow",
    "categoria": "SDN",
    "contenuto": "Protocollo tra controller e switch SDN. Permette regole di forwarding basate su <match, action>, gestione dei pacchetti e monitoraggio della rete."
  },
  {
    "id": 160,
    "titolo": "SDN Controller",
    "categoria": "SDN",
    "contenuto": "Software centrale che controlla la rete SDN. Fornisce visione globale e interfacce suddivise (southbound, core, northbound). Supporta estendibilità, multivendor e gestione cross-domain."
  },
  {
    "id": 161,
    "titolo": "Modelli SDN: Proattivo vs Reattivo",
    "categoria": "SDN",
    "contenuto": "Proattivo: regole preinstallate. Reattivo: regole create in risposta al traffico. Adatti a scenari diversi."
  },
  {
    "id": 162,
    "titolo": "NFV - Network Functions Virtualization",
    "categoria": "NFV",
    "contenuto": "Virtualizzazione delle funzioni di rete (es. firewall, NAT, IDS) su hardware standard. Riduce costi, aumenta flessibilità e provisioning rapido."
  },
  {
    "id": 163,
    "titolo": "Componenti NFV",
    "categoria": "NFV",
    "contenuto": "VNF (funzione virtualizzata), NFVI (infrastruttura), VIM (gestione risorse), VNF Manager e Orchestrator (gestione ciclo di vita e orchestrazione)."
  },
  {
    "id": 164,
    "titolo": "Service Function Chaining (SFC)",
    "categoria": "SFC",
    "contenuto": "Sequenza di funzioni di rete da applicare a un flusso. Realizzabile con SDN (instradamento flussi) e NFV (funzioni virtualizzate)."
  },
  {
    "id": 165,
    "titolo": "SDN e SFC",
    "categoria": "SFC",
    "contenuto": "SDN consente di instradare dinamicamente i flussi attraverso catene di servizi personalizzate via OpenFlow."
  },
  {
    "id": 166,
    "titolo": "NFV e SFC",
    "categoria": "SFC",
    "contenuto": "Le funzioni della catena sono software virtualizzati su server standard. Gestione più flessibile e scalabile."
  },
  {
    "id": 167,
    "titolo": "Routing vs Forwarding",
    "categoria": "Routing",
    "contenuto": "Routing = scelta del percorso (control plane, RIB). Forwarding = inoltro pacchetti (data plane, FIB)."
  },
  {
    "id": 168,
    "titolo": "Tipi di Forwarding",
    "categoria": "Routing",
    "contenuto": "Per indirizzo (IP), per etichetta (MPLS), o source routing (sorgente definisce percorso)."
  },
  {
    "id": 169,
    "titolo": "Algoritmi di Routing Statici",
    "categoria": "Routing",
    "contenuto": "Percorsi fissi: es. static routing, flooding, random walk. Non reagiscono a cambiamenti."
  },
  {
    "id": 170,
    "titolo": "Algoritmi di Routing Dinamici",
    "categoria": "Routing",
    "contenuto": "Aggiornamento automatico della topologia. Tipi: centralized o distributed (Distance Vector, Link State)."
  },
  {
    "id": 171,
    "titolo": "Distance Vector",
    "categoria": "Routing",
    "contenuto": "Algoritmo Bellman-Ford. Ogni router scambia vettori di distanza. Problemi: loop, count to infinity."
  },
  {
    "id": 172,
    "titolo": "Link State",
    "categoria": "Routing",
    "contenuto": "Ogni router flooda info topologia e calcola mappa con Dijkstra. Convergenza veloce, più complesso."
  },
  {
    "id": 173,
    "titolo": "Intra-AS vs Inter-AS Routing",
    "categoria": "Routing",
    "contenuto": "Intra-AS: es. OSPF, RIP. Inter-AS: BGP. Routing interno vs tra AS diversi, con politiche e autonomia."
  },
  {
    "id": 174,
    "titolo": "OSPF",
    "categoria": "IGP",
    "contenuto": "Protocollo Link State per Intra-AS. Usa Dijkstra, supporta gerarchie, ECMP, autenticazione, multicast."
  },
  {
    "id": 175,
    "titolo": "BGP",
    "categoria": "EGP",
    "contenuto": "Protocollo Path Vector. Usa AS-PATH, NEXT-HOP, policy. Gestisce inter-AS routing su Internet."
  },
  {
    "id": 176,
    "titolo": "Politiche di Routing",
    "categoria": "Routing",
    "contenuto": "Filtraggio, manipolazione path, PBR, preferenze geografiche. Modificano comportamento del routing."
  },
  {
    "id": 177,
    "titolo": "LSP - Label Switched Path",
    "categoria": "MPLS",
    "contenuto": "Percorso unidirezionale MPLS tra ingress ed egress router. Guidato da label, non da IP."
  },
  {
    "id": 178,
    "titolo": "IS-IS",
    "categoria": "IGP",
    "contenuto": "IS-IS (Intermediate System to Intermediate System) è un protocollo di routing di tipo link-state usato principalmente in reti di grandi dimensioni. A differenza di OSPF, funziona direttamente sopra il livello 2 (data link), rendendolo indipendente da IP. Supporta routing gerarchico tramite due livelli: Level 1 (intra-area) e Level 2 (inter-area). È molto usato in ambienti ISP e MPLS per la sua scalabilità, efficienza e capacità di trasportare anche informazioni non IP tramite l’uso di TLV (Type-Length-Value). Utilizza l’algoritmo SPF (Dijkstra) per calcolare i percorsi ottimali."
  },
  {
    "id": 179,
    "titolo": "LAN",
    "categoria": "Networking",
    "contenuto": "Rete locale che collega dispositivi in un’area geografica limitata. Usa switch, hub, bridge per connettività locale."
  },
  {
    "id": 180,
    "titolo": "Repeater e Hub",
    "categoria": "Networking",
    "contenuto": "Rigenerano il segnale. Hub copia ogni frame su tutte le porte. Nessuna intelligenza o filtraggio."
  },
  {
    "id": 181,
    "titolo": "Bridge",
    "categoria": "Networking",
    "contenuto": "Collega segmenti Ethernet, riduce collisioni filtrando per indirizzo MAC. Crea collision domain separati."
  },
  {
    "id": 182,
    "titolo": "Collision Domain vs Broadcast Domain",
    "categoria": "Networking",
    "contenuto": "Collision domain = area con rischio collisioni. Broadcast domain = area dove si propagano i broadcast, limitato dai router."
  },
  {
    "id": 183,
    "titolo": "Half-Duplex vs Full-Duplex",
    "categoria": "Networking",
    "contenuto": "Half-duplex: trasmissione alternata, causa collisioni. Full-duplex: trasmissione simultanea, nessuna collisione."
  },
  {
    "id": 184,
    "titolo": "Transparent Bridge / Switch",
    "categoria": "Networking",
    "contenuto": "Collega segmenti Ethernet in modo trasparente per gli host. Nessuna configurazione richiesta lato utente."
  },
  {
    "id": 185,
    "titolo": "Indirizzi MAC e Porta",
    "categoria": "Networking",
    "contenuto": "Lo switch apprende quali MAC sono su quali porte tramite backward learning osservando il traffico."
  },
  {
    "id": 186,
    "titolo": "Smart Forwarding",
    "categoria": "Networking",
    "contenuto": "Lo switch inoltra frame solo sulla porta corretta se il MAC è noto, altrimenti fa flooding."
  },
  {
    "id": 187,
    "titolo": "Filtering Database (FDB)",
    "categoria": "Networking",
    "contenuto": "Tabella che associa MAC alle porte. Timeout automatico per rimozione MAC inattivi."
  },
  {
    "id": 188,
    "titolo": "Backward Learning",
    "categoria": "Networking",
    "contenuto": "Lo switch impara gli indirizzi MAC osservando i frame ricevuti, aggiornando dinamicamente la FDB."
  },
  {
    "id": 189,
    "titolo": "Attacchi MAC Flooding",
    "categoria": "Networking",
    "contenuto": "L’attaccante inonda lo switch con MAC falsi, esaurendo la FDB e forzando il flooding del traffico."
  },
  {
    "id": 190,
    "titolo": "Broadcast Storm",
    "categoria": "Networking",
    "contenuto": "Traffico broadcast che cresce senza controllo, causato da loop fisici senza STP. Nessun TTL nei frame Ethernet."
  },
  {
    "id": 191,
    "titolo": "Spanning Tree Protocol (STP)",
    "categoria": "Networking",
    "contenuto": "Disabilita porte per eliminare loop. Topologia ad albero. Standard IEEE 802.1D."
  },
  {
    "id": 192,
    "titolo": "Router e Broadcast Domain",
    "categoria": "Networking",
    "contenuto": "I router separano i broadcast domain. Necessari per isolare traffico, aumentare sicurezza e prestazioni."
  },
  {
    "id": 193,
    "titolo": "VLAN",
    "categoria": "Networking",
    "contenuto": "Segmentazione logica della rete su un’infrastruttura fisica condivisa. Ogni VLAN è un dominio di broadcast isolato."
  },
  {
    "id": 194,
    "titolo": "VLAN Tagging",
    "categoria": "Networking",
    "contenuto": "IEEE 802.1Q aggiunge tag VLAN ai frame Ethernet (4 byte). Necessario per trunking tra switch."
  },
  {
    "id": 195,
    "titolo": "Access Port vs Trunk Port",
    "categoria": "Networking",
    "contenuto": "Le porte Access trasportano frame non taggati e appartengono a una sola VLAN. Le porte Trunk trasportano frame taggati e possono veicolare traffico di più VLAN, permettendo la comunicazione tra switch mantenendo la separazione logica delle VLAN."
  },
  {
    "id": 196,
    "titolo": "Spanning Tree per VLAN",
    "categoria": "Networking",
    "contenuto": "Ogni VLAN può avere un proprio albero STP (Per-VLAN STP). Più flessibile ma più complesso."
  },
  {
    "id": 197,
    "titolo": "Routing vs Forwarding",
    "categoria": "Networking",
    "contenuto": "Routing = calcolo percorso, control plane. Forwarding = inoltro pacchetti, data plane, uso tabella FIB."
  },
  {
    "id": 198,
    "titolo": "Algoritmi di Routing",
    "categoria": "Networking",
    "contenuto": "Statici (fixed, flooding) e dinamici (distance vector, link state). Possono essere centralizzati o distribuiti."
  },
  {
    "id": 199,
    "titolo": "Reti Wireless e Mobili",
    "categoria": "Wireless",
    "contenuto": "Le reti 4G/5G usano stack IP e supportano SDN. Wireless = collegamento radio, Mobilità = cambio di accesso senza interruzioni."
  },
  {
    "id": 200,
    "titolo": "Elementi rete wireless",
    "categoria": "Wireless",
    "contenuto": "Host wireless, base station, collegamento wireless. Modalità infrastrutturata (con AP) o ad hoc (tra dispositivi)."
  },
  {
    "id": 201,
    "titolo": "Caratteristiche collegamento wireless",
    "categoria": "Wireless",
    "contenuto": "Attenuazione, interferenze, propagazione multipercorso. SNR alto = minor BER. Hidden terminal e attenuazione tra nodi distanti."
  },
  {
    "id": 202,
    "titolo": "IEEE 802.11 Architettura",
    "categoria": "Wi-Fi",
    "contenuto": "BSS: host + AP. Canali assegnati manualmente. Associazione tramite beacon e autenticazione via DHCP."
  },
  {
    "id": 203,
    "titolo": "Scansione Wi-Fi",
    "categoria": "Wi-Fi",
    "contenuto": "Passiva: AP invia beacon. Attiva: host invia probe. Passiva è silenziosa, attiva è più veloce ma visibile."
  },
  {
    "id": 204,
    "titolo": "CSMA/CA e RTS/CTS",
    "categoria": "Wi-Fi",
    "contenuto": "Evita collisioni. RTS/CTS opzionale per nodo nascosto. CSMA/CA previene, non rileva collisioni."
  },
  {
    "id": 205,
    "titolo": "IEEE 802.11 Frame e Mobilità",
    "categoria": "Wi-Fi",
    "contenuto": "Frame ha 4 MAC. Handoff tra AP senza cambio IP. QoS, power saving, frame aggregation, MIMO."
  },
  {
    "id": 206,
    "titolo": "Reti Cellulari e Celle",
    "categoria": "Cellular",
    "contenuto": "Celle teoriche esagonali, reali variabili. Macrocell e microcell. Reti supportano handover continuo."
  },
  {
    "id": 207,
    "titolo": "Multiple Access e Riutilizzo",
    "categoria": "Cellular",
    "contenuto": "FDMA, TDMA, CDMA, SDMA. Riutilizzo frequenze controllato da cluster. Tradeoff tra capacità e qualità."
  },
  {
    "id": 208,
    "titolo": "Tecniche per aumentare capacità",
    "categoria": "Cellular",
    "contenuto": "Cell splitting, sectoring, tilting, femtocell. Adattamento copertura con cell shaping e antenne direzionali."
  },
  {
    "id": 209,
    "titolo": "Tecniche per aumentare capacità",
    "categoria": "Cellular",
    "contenuto": "Cell splitting, sectoring, tilting, femtocell. Adattamento copertura con cell shaping e antenne direzionali."
  },
  {
    "id": 210,
    "titolo": "FDMA (Frequency Division Multiple Access)",
    "categoria": "Reti Cellulari",
    "contenuto": "È una tecnica in cui ogni utente ha una propria frequenza per comunicare. Usata nelle prime reti mobili (come la 1G). Ogni chiamata occupa un canale separato, quindi non ci sono interferenze tra utenti, ma si spreca banda perché i canali sono fissi anche se non usati."
  },
  {
    "id": 211,
    "titolo": "Count to Infinity",
    "categoria": "Routing",
    "contenuto": "Problema tipico dei protocolli distance vector, dove in caso di guasto i router continuano ad aumentare il numero di hop verso una rete irraggiungibile senza mai convergere. Succede perché ogni router crede che un altro abbia ancora una rotta valida. I protocolli esposti al problema sono RIP e IGRP. Protocolli come OSPF, EIGRP, IS-IS e BGP non ne sono affetti."
  },
  {
    "id": 212,
    "titolo": "Calcolo Range Subnet",
    "categoria": "Subnetting",
    "contenuto": "Per calcolare il range di una subnet, fai così:\n1. Calcola i bit liberi: 32 - subnet (es. /22 → 10 bit).\n2. Calcola il numero di IP: 2^(bit liberi).\n3. Somma questo numero all'indirizzo base -1 per trovare il broadcast.\nEsempio: 192.168.0.0/22 ha 10 bit liberi → 1024 IP → range: 192.168.0.0 - 192.168.3.255."
  },
  {
    "id": 213,
    "titolo": "Regole Aggregazione IP",
    "categoria": "Subnetting",
    "contenuto": "Puoi aggregare IP solo se:\n1. Sono contigui nel range binario.\n2. I primi N bit coincidono (dove N è il nuovo prefisso).\n3. L'aggregazione non include reti non richieste.\nEsempio: 192.168.0.0/24 e 192.168.1.0/24 → aggregabili in 192.168.0.0/23. Ma 192.168.0.0/24 e 192.168.2.0/24 no, a meno di includere anche 192.168.1.0/24 (con /22)."
  },
  {
    "id": 214,
    "titolo": "Funzionamento Link State Routing",
    "categoria": "Routing",
    "contenuto": "Nei protocolli Link State (es. OSPF), ogni router riceve informazioni topologiche da tutti gli altri e costruisce localmente un Link State Database. Usa poi l'algoritmo di Dijkstra per calcolare autonomamente i percorsi ottimali verso ogni destinazione. Il risultato di questo calcolo è salvato nella routing table, che viene comunque utilizzata per l'instradamento."
  },
  {
    "id": 215,
    "titolo": "Inter-VLAN Routing",
    "categoria": "Reti VLAN",
    "contenuto": "L'inter-VLAN routing permette a host appartenenti a VLAN diverse di comunicare tra loro. Poiché le VLAN operano a livello 2 (Data Link), il traffico tra VLAN richiede un dispositivo di livello 3 (router o switch Layer 3) che effettui il routing tra le reti logiche associate a ciascuna VLAN."
  },
  {
    "id": 216,
    "titolo": "Classificazione Protocolli di Routing",
    "categoria": "Routing",
    "contenuto": "Distance_vector: [RIP, IGRP]. Link_state: [OSPF, IS-IS]"
  },
  {
    "id": 217,
    "titolo": "Blocco del transito in un Autonomous System (AS)",
    "categoria": "Routing",
    "contenuto": "Un AS può impedire il transito non annunciando a un vicino le route apprese da un altro vicino, tramite politiche di BGP (es. filtraggio o mascheramento delle route). Per rafforzare il controllo, un AS può usare access list per bloccare pacchetti in transito, scartando quelli che provengono da un AS e sono destinati a un altro."
  },
  {
    "id": 218,
    "titolo": "Protocollo di assegnazione delle Label in MPLS",
    "categoria": "MPLS",
    "contenuto": {
      "label_distribution": [
        "Il protocollo principale usato per l’assegnazione delle label in MPLS è il LDP (Label Distribution Protocol).",
        "Altri protocolli come RSVP-TE possono assegnare label nel contesto di traffico ingegnerizzato (Traffic Engineering)."
      ]
    }
  },
  {
    "id": 219,
    "titolo": "Forwarding Equivalence Class (FEC) in MPLS",
    "categoria": "MPLS",
    "contenuto": "In MPLS, una Forwarding Equivalence Class (FEC) è un insieme di pacchetti che vengono inoltrati allo stesso modo nella rete. I pacchetti vengono classificati in FEC dai router di ingresso (LER), ai quali viene assegnata una label specifica. I router interni (LSR) usano solo la label per il forwarding, senza analizzare l’header IP. Una FEC può includere pacchetti con stessa destinazione, requisiti QoS simili o appartenenti a una VPN. Questo approccio migliora la scalabilità, velocizza il forwarding e offre maggiore flessibilità nella gestione del traffico."
  },
  {
    "id": 220,
    "titolo": "Indirizzo Link-Local in IPv6",
    "categoria": "IPv6",
    "contenuto": "Un indirizzo link-local in IPv6 è un tipo di indirizzo utilizzabile per permettere la comunicazione tra stazioni su un link locale (come una LAN), anche in assenza di altri indirizzi IPv6 configurati. Viene automaticamente assegnato a ogni interfaccia con prefisso FE80::/10 e non è instradabile al di fuori del link locale. Serve principalmente per funzioni di rete interne come il Neighbor Discovery o il routing locale."
  },
  {
    "id": 221,
    "titolo": "VPN Gateway",
    "categoria": "VPN",
    "contenuto": "Un VPN Gateway è un dispositivo (fisico o virtuale) che gestisce connessioni VPN tra reti diverse o tra client remoti e una rete aziendale. Si occupa della crittografia, decrittografia e autenticazione del traffico che attraversa il tunnel VPN. Opera tipicamente su protocolli come IPSec, SSL/TLS o L2TP, garantendo comunicazioni sicure su reti non sicure come Internet."
  },
  {
    "id": 222,
    "titolo": "Rete GSM e Regular Burst",
    "categoria": "Reti Mobili",
    "contenuto": "La rete GSM (Global System for Mobile Communications) è uno standard per reti mobili 2G, usato per la trasmissione di voce e dati tramite tecnologia a commutazione di circuito. Utilizza TDMA per dividere ogni frequenza in slot temporali. Il 'regular burst' è il tipo di trasmissione più comune nei time slot della GSM, utilizzato per inviare campioni vocali oppure, in caso di necessità, alcune informazioni di controllo. Contiene dati utente e parte dell'header, ed è impiegato durante le normali comunicazioni vocali e dati."
  },
  {
    "id": 223,
    "titolo": "LSA (Link-State Advertisement) in OSPF",
    "categoria": "OSPF",
    "contenuto": "In OSPF (Open Shortest Path First), un LSA (Link-State Advertisement) è un messaggio utilizzato dai router per comunicare informazioni sullo stato dei propri link alla rete. Gli LSA vengono scambiati tra router per costruire la topologia di rete condivisa. OSPF utilizza diversi tipi di LSA (es. Type 1 Router LSA, Type 2 Network LSA, ecc.), che vengono propagati all'interno dell'area OSPF per garantire la coerenza delle tabelle di routing."
  },
  {
    "id": 224,
    "titolo": "Protocollo OSPF (Open Shortest Path First)",
    "categoria": "Routing",
    "contenuto": "OSPF è un protocollo di routing interno (IGP) di tipo link-state, usato per calcolare il percorso più breve verso ogni rete in una rete IP. Ogni router costruisce una mappa completa della topologia della rete basandosi sugli LSA (Link-State Advertisements) ricevuti dagli altri router. Utilizza l’algoritmo di Dijkstra per calcolare il percorso più breve. Supporta la divisione in aree per migliorare la scalabilità (es. backbone area 0). OSPF è veloce nel convergere e supporta VLSM, load balancing e autenticazione."
  },
  {
    "id": 225,
    "titolo": "Multicast Groups in IPv4",
    "categoria": "IPv4",
    "contenuto": "La risposta corretta è la **B**. I gruppi multicast in IPv4 sono identificati tramite indirizzi IP speciali nella gamma 224.0.0.0 – 239.255.255.255, che **non possono essere assegnati a singoli host**. Quando un pacchetto è inviato a un indirizzo multicast, tutti i membri del gruppo che hanno aderito a quell'indirizzo lo ricevono. Gli indirizzi IP unicast o le MAC address **non** vengono usati per identificare i gruppi."
  },
  {
    "id": 226,
    "titolo": "OSPF-TE e IS-IS-TE in MPLS",
    "categoria": "MPLS / Traffic Engineering",
    "contenuto": "La risposta **A è corretta**. OSPF-TE e IS-IS-TE sono estensioni dei protocolli di routing OSPF e IS-IS, standardizzate per supportare il **Traffic Engineering (TE)** in ambienti MPLS. Permettono di distribuire informazioni aggiuntive chiamate **constrained data** (es. banda disponibile, delay, attributi di link) necessarie per il **constraint-based routing**, cioè la selezione di percorsi che soddisfano vincoli specifici oltre alla semplice distanza."
  },
  {
    "id": 227,
    "titolo": "Multicast Communications in IPv4",
    "categoria": "IPv4",
    "contenuto": "La frase è **corretta**. Le comunicazioni multicast in una rete IPv4 **non sono possibili** solo con l'uso del protocollo IP base. Richiedono l'implementazione di **protocolli aggiuntivi** come IGMP (Internet Group Management Protocol) per la gestione dell'iscrizione ai gruppi multicast e protocolli di routing multicast come PIM (Protocol Independent Multicast) per la distribuzione dei pacchetti nella rete."
  },
  {
    "id": 228,
    "titolo": "Distance Vector Routing Algorithm",
    "categoria": "Routing",
    "contenuto": "La frase è **corretta**. L'algoritmo di routing Distance Vector viene usato in scenari specifici, in particolare in reti più semplici o di piccole dimensioni, dove la scalabilità e la convergenza rapida non sono requisiti critici. È adottato da protocolli come RIP (Routing Information Protocol). Ogni router condivide periodicamente la propria tabella di routing con i vicini, ma è soggetto a problemi come il count-to-infinity e convergenza lenta, motivo per cui in reti complesse si preferiscono algoritmi più avanzati come il Link-State (OSPF, IS-IS)."
  },
  {
    "id": 229,
    "titolo": "Distance Vector Routing Algorithm",
    "categoria": "Routing",
    "contenuto": "L'algoritmo di routing Distance Vector viene usato in scenari specifici, in particolare in reti più semplici o di piccole dimensioni, dove la scalabilità e la convergenza rapida non sono requisiti critici. È adottato da protocolli come RIP (Routing Information Protocol). Ogni router condivide periodicamente la propria tabella di routing con i vicini, ma è soggetto a problemi come il count-to-infinity e convergenza lenta, motivo per cui in reti complesse si preferiscono algoritmi più avanzati come il Link-State (OSPF, IS-IS)."
  },
  {
    "id": 230,
    "titolo": "Optical Switch",
    "categoria": "Reti Ottiche",
    "contenuto": "Uno switch ottico è un dispositivo in grado di commutare un canale ottico su una determinata lunghezza d’onda da una fibra in ingresso a una fibra in uscita. Viene utilizzato nelle reti WDM (Wavelength Division Multiplexing) per instradare dinamicamente i segnali ottici senza convertirli in segnali elettrici, migliorando efficienza, velocità e trasparenza del trasporto dati."
  },
  {
    "id": 231,
    "titolo": "GRE (Generic Routing Encapsulation) Protocol",
    "categoria": "Tunneling",
    "contenuto": "Il protocollo GRE è utilizzato per incapsulare diversi protocolli di livello rete (come IP, IPv6, o altri) all'interno di pacchetti IP. Serve per creare tunnel tra due nodi, trasportando payload multiprotocollo attraverso reti IP. Il campo 'Protocol Type' nell'intestazione GRE specifica quale protocollo è stato incapsulato, permettendo la corretta identificazione e decapsulazione del pacchetto al ricevente."
  },
  {
    "id": 232,
    "titolo": "Routing Redistribution",
    "categoria": "Routing",
    "contenuto": "La redistribuzione nel routing consiste nel prendere rotte apprese tramite un protocollo di routing (es. OSPF) e pubblicarle in un altro protocollo (es. RIP o BGP). Questo permette l'interoperabilità tra protocolli diversi, ma può causare **perdita di informazioni** come metriche o attributi specifici del protocollo originale, portando a decisioni di instradamento subottimali se non gestita correttamente."
  },
  {
    "id": 233,
    "titolo": "Topology-Based Control-Driven Label Binding",
    "categoria": "MPLS",
    "contenuto": "Nel meccanismo di label binding basato sulla topologia e controllato dal piano di controllo, un LSP (Label Switched Path) viene configurato automaticamente in base alla topologia della rete, quando viene scoperto un percorso verso una destinazione. In pratica, per ogni destinazione raggiungibile, viene creato un LSP, seguendo le rotte calcolate dai protocolli di routing (es. OSPF o IS-IS). Questo approccio è tipico dell'uso di LDP (Label Distribution Protocol) in MPLS."
  },
  {
    "id": 234,
    "titolo": "DWDM (Dense Wavelength Division Multiplexing)",
    "categoria": "Reti Ottiche",
    "contenuto": "La tecnologia DWDM consente di multiplexare e demultiplexare segnali ottici caratterizzati da diverse lunghezze d’onda sulla stessa fibra ottica. Ogni canale usa una lunghezza d’onda distinta, permettendo la trasmissione parallela di decine o centinaia di flussi indipendenti su un singolo collegamento fisico, aumentando enormemente la capacità di trasporto delle reti ottiche."
  },
  {
    "id": 235,
    "titolo": "IPv6 Stateless Address Autoconfiguration (SLAAC)",
    "categoria": "IPv6",
    "contenuto": "Un host IPv6 può autoconfigurare il proprio indirizzo IP utilizzando **SLAAC** (Stateless Address Autoconfiguration). In questo processo, il router invia un **prefisso di rete** tramite messaggi Router Advertisement (RA), mentre l’host genera in modo autonomo l’**interface ID**, che può essere basato su un valore casuale o derivato dall’indirizzo MAC. L'indirizzo completo è ottenuto combinando prefisso e interface ID."
  },
  {
    "id": 236,
    "titolo": "Modern Ethernet Networks",
    "categoria": "Ethernet",
    "contenuto": "Le reti Ethernet moderne sono tipicamente basate su **switch** come dispositivi di interconnessione, che operano a livello 2 (data link) e instradano i frame in base agli indirizzi MAC. La segmentazione della rete non avviene più tramite dispositivi fisici separati, ma è effettuata in modo **virtuale** attraverso le **VLAN (Virtual LANs)**, che isolano il traffico tra gruppi di porte configurate logicamente sullo switch."
  },
  {
    "id": 237,
    "titolo": "Comunicazione tra host IPv4 e IPv6",
    "categoria": "Reti IP",
    "contenuto": "Un host IPv4 non può comunicare direttamente con un host IPv6 perché usano formati di pacchetto incompatibili. Tuttavia, la comunicazione può avvenire utilizzando un nodo intermedio chiamato **gateway di traduzione (es. NAT64)**, che riceve i pacchetti IPv4, li converte in pacchetti IPv6 (modificando l'header e l'indirizzo di destinazione), e li inoltra all'host IPv6, e viceversa. Questo processo è chiamato **translation**."
  },
  {
    "id": 238,
    "titolo": "Conversione tra IPv4 e IPv6",
    "categoria": "Reti IP",
    "contenuto": "IPv4 e IPv6 sono protocolli incompatibili, quindi non esiste una vera 'conversione diretta'. Si usano due approcci:\n\n1. **Traduzione (Translation)**: modifica dell'header del pacchetto da IPv4 a IPv6 e viceversa. Esempi: NAT64 (stateful), SIIT (stateless).\n2. **Tunneling**: incapsulamento dei pacchetti IPv6 dentro pacchetti IPv4 (o viceversa) per attraversare una rete incompatibile. Esempi: 6to4, Teredo, ISATAP.\n\nLa 'conversione' più semplice è rappresentare un IPv4 in formato IPv6: ad esempio `192.0.2.1` diventa `::ffff:192.0.2.1` (IPv4-mapped IPv6 address)."
  },
  {
    "id": 239,
    "titolo": "Funzionamento sintetico dei protocolli di routing",
    "categoria": "Reti IP",
    "contenuto": "RIP: usa hop-count (max 15), invia tutta la tabella ogni 30s, semplice ma lento. OSPF: link-state con algoritmo Dijkstra, supporta gerarchia e convergenza veloce. EIGRP: protocollo ibrido, invia solo variazioni, usa metrica composita, proprietario Cisco. BGP: path-vector tra Autonomous System, scambia rotte via TCP, controllato da policy, usato su Internet."
  },
  {
    "id": 240,
    "titolo": "Funzionamento sintetico dei protocolli di routing",
    "categoria": "Reti IP",
    "contenuto": "RIP: usa hop-count (max 15), invia tutta la tabella ogni 30s, semplice ma lento. OSPF: link-state con algoritmo Dijkstra, supporta gerarchia e convergenza veloce. EIGRP: protocollo ibrido, invia solo variazioni, usa metrica composita, proprietario Cisco. BGP: path-vector tra Autonomous System, scambia rotte via TCP, controllato da policy, usato su Internet."
  },
  {
    "id": 241,
    "titolo": "Indirizzi IP in una VPN access provider-provisioned",
    "categoria": "VPN",
    "contenuto": "In una soluzione VPN di tipo access (provider-provisioned), un host remoto dispone di due indirizzi IP: uno pubblico o di rete locale usato per raggiungere il gateway VPN aziendale e host esterni, e uno assegnato dal gateway VPN per comunicare con host interni alla rete aziendale. Questo permette di separare il traffico interno da quello esterno e garantire sicurezza e routing appropriato."
  },
  {
    "id": 242,
    "titolo": "Uso del protocollo PPTP",
    "categoria": "VPN",
    "contenuto": "Il protocollo PPTP (Point-to-Point Tunneling Protocol) viene solitamente utilizzato per creare un tunnel in una VPN di accesso, cioè tra un host remoto e una rete aziendale. È un protocollo di tipo client-server che incapsula il traffico PPP in pacchetti IP. Pertanto, la risposta corretta è: 0) Permettere di creare un tunnel in una VPN di accesso."
  },
  {
    "id": 243,
    "titolo": "Flooding e Time To Live (TTL)",
    "categoria": "Routing",
    "contenuto": "Il flooding è un algoritmo di routing in cui ogni router inoltra una copia del pacchetto su tutte le interfacce eccetto quella di arrivo. Questo può generare molte copie dello stesso pacchetto nella rete, specialmente in topologie cicliche. Per evitare che i pacchetti circolino all'infinito, si utilizza il campo TTL (Time To Live), che viene decrementato a ogni hop. Quando il TTL raggiunge zero, il pacchetto viene scartato. Pertanto, il numero di copie che raggiungono una destinazione può essere proporzionale al valore iniziale del TTL."
  },
  {
    "id": 244,
    "titolo": "Instaurazione di un LSP in MPLS",
    "categoria": "MPLS",
    "contenuto": "Per instaurare un Label Switched Path (LSP) in una rete MPLS, è indispensabile che ogni router lungo il percorso esegua un'operazione di mapping, ovvero associ una Forwarding Equivalence Class (FEC) a un'etichetta (label). Questo mapping può essere effettuato tramite protocolli come LDP o RSVP-TE, che distribuiscono le label tra router adiacenti. Senza questa associazione tra FEC e label, il forwarding MPLS non può avvenire."
  },
  {
    "id": 245,
    "titolo": "Operazioni di mapping nei router MPLS",
    "categoria": "MPLS",
    "contenuto": "In un LSP (Label Switched Path), ogni router MPLS esegue una singola operazione di mapping locale, associando una FEC (Forwarding Equivalence Class) a una label. Questo mapping viene poi comunicato ai router adiacenti tramite un protocollo di distribuzione delle label, come LDP o RSVP-TE. Se il percorso attraversa N router MPLS, avvengono N operazioni di mapping, una per ciascun nodo."
  },
  {
    "id": 246,
    "titolo": "Indirizzi IPv6 link-local",
    "categoria": "IPv6",
    "contenuto": "Gli indirizzi link-local in IPv6 sono utilizzabili per la comunicazione tra dispositivi sullo stesso link fisico (es. una LAN), anche in assenza di un indirizzo globale o di un server DHCPv6. Ogni interfaccia IPv6 ne possiede almeno uno, con prefisso FE80::/10, e sono essenziali per protocolli come Neighbor Discovery e routing locale."
  },
  {
    "id": 247,
    "titolo": "Piano di indirizzamento IP basato su aree",
    "categoria": "Subnetting",
    "contenuto": "In una rete composta da più reti fisiche interconnesse da router, è possibile ottimizzare il routing definendo un piano di indirizzamento gerarchico. Questo si ottiene suddividendo la rete in aree e assegnando a ciascuna area un sottoinsieme distinto del range di indirizzi IP disponibile. In questo modo si riduce la dimensione delle tabelle di routing e si migliora l'efficienza del processo di inoltro, soprattutto su router centrali o di backbone."
  },
  {
    "id": 248,
    "titolo": "High Speed Packet Access (HSPA)",
    "categoria": "Reti Mobili",
    "contenuto": "L'High Speed Packet Access (HSPA) è una tecnologia di potenziamento delle reti UMTS che utilizza canali condivisi per ottimizzare l'uso delle risorse radio. Invece di allocare un canale dedicato per ciascun utente, HSPA assegna dinamicamente la capacità disponibile in base alla domanda e alle condizioni del canale, riducendo così lo spreco di risorse e aumentando l'efficienza spettrale."
  },
  {
    "id": 249,
    "titolo": "IPv6 Aggregable Global Unicast",
    "categoria": "IPv6",
    "contenuto": "Gli indirizzi IPv6 Aggregable Global Unicast sono univoci a livello globale e instradabili su Internet, analogamente agli indirizzi IPv4 pubblici. Sono progettati per supportare l'aggregazione gerarchica, riducendo la dimensione delle tabelle di routing. Iniziano tipicamente con il prefisso 2000::/3 e sono assegnati dagli ISP o da registri regionali."
  },
  {
    "id": 250,
    "titolo": "Intestazioni in un tunnel GRE",
    "categoria": "Tunneling",
    "contenuto": "In un pacchetto che viaggia all'interno di un tunnel GRE (Generic Routing Encapsulation), sono presenti tipicamente due intestazioni: una intestazione esterna IP che permette il trasporto del pacchetto attraverso la rete, e una intestazione GRE che incapsula il pacchetto originale. Non ci sono particolari limitazioni sul tipo di pacchetto incapsulato, il che rende GRE molto flessibile per il tunneling di protocolli diversi."
  },
  {
    "id": 251,
    "titolo": "Circuit Switched Networks e Burst",
    "categoria": "Reti di comunicazione",
    "contenuto": "Le reti circuit-switched, come quelle telefoniche tradizionali, stabiliscono un circuito fisico dedicato tra mittente e destinatario per tutta la durata della comunicazione, garantendo banda costante ma con spreco se il canale non è pienamente usato. I 'burst' sono sequenze concentrate e rapide di dati trasmesse in un breve intervallo, tipiche delle reti a pacchetto, dove la trasmissione non è continua ma intermittente, ottimizzando l'uso della banda disponibile."
  },
  {
    "id": 252,
    "titolo": "Token Bucket e Leaky Bucket",
    "categoria": "Quality of Service (QoS)",
    "contenuto": "I meccanismi 'Token Bucket' (secchiello e gettone) e 'Leaky Bucket' sono utilizzati per il controllo del traffico nelle reti, in particolare per gestire il burst e garantire QoS. Il Token Bucket permette trasmissioni burst quando ci sono gettoni accumulati, ma limita la velocità media nel tempo. È flessibile e adatto a traffico variabile. Il Leaky Bucket impone una trasmissione a velocità costante, utile per modellare il traffico. Entrambi sono usati in reti IP, router e apparati per policing e shaping del traffico."
  },
  {
    "id": 253,
    "titolo": "Indirizzo multicast per Neighbor Solicitation",
    "categoria": "IPv6",
    "contenuto": "In IPv6, i messaggi di Neighbor Solicitation usano come indirizzo di destinazione un indirizzo multicast del tipo 'solicited-node multicast address'. Questo indirizzo ha il formato ff02::1:ffXX:XXXX, dove gli ultimi 24 bit coincidono con gli ultimi 24 bit dell'indirizzo IPv6 del destinatario. Serve a limitare la diffusione del pacchetto solo ai nodi che potrebbero possedere quell’indirizzo, riducendo il traffico rispetto a un broadcast."
  },
  {
    "id": 254,
    "titolo": "VPN basate su SSL",
    "categoria": "VPN",
    "contenuto": "Le VPN basate su SSL (Secure Sockets Layer) utilizzano protocolli crittografici a livello di trasporto per creare un canale sicuro tra client e server, tipicamente attraverso il browser. A differenza delle VPN IPsec, non richiedono software dedicato né configurazioni complesse sul client. Operano su HTTPS (porta 443), quindi superano facilmente firewall e NAT. Offrono sicurezza, accesso remoto selettivo e facilità di implementazione, ma sono più adatte a scenari di accesso remoto specifico, non a collegamenti site-to-site."
  },
  {
    "id": 255,
    "titolo": "Reti Mobili",
    "categoria": "Reti Mobili",
    "contenuto": "Le reti mobili sono organizzate in una struttura gerarchica che collega i terminali mobili (MT, Mobile Terminal) alla rete core dell'operatore. Il terminale comunica via radio con una BTS (Base Transceiver Station), che gestisce la trasmissione e ricezione sul canale radio. Più BTS sono gestite da una BSC (Base Station Controller), che coordina risorse radio, handover e accesso. Le BSC si collegano al MSC (Mobile Switching Center), che gestisce la commutazione, la mobilità e l'instradamento verso la rete telefonica (PSTN) o la rete dati. A supporto ci sono HLR/VLR per la gestione dei dati utente, e SGSN/GGSN (in reti 3G) per l'accesso ai servizi dati. Le comunicazioni avvengono via radio nell'accesso, poi via collegamenti cablati o a pacchetto nel backhaul e nel core di rete."
  },
  {
    "id": 256,
    "titolo": "LTE (Long Term Evolution)",
    "categoria": "Reti Mobili",
    "contenuto": "LTE è una tecnologia di rete mobile di quarta generazione (4G) progettata per fornire alta velocità e bassa latenza. L'architettura è semplificata e basata su pacchetto (All-IP). Il terminale (UE, User Equipment) comunica via radio con l'eNodeB (evolved Node B), che unisce le funzioni di BTS e BSC. L'eNodeB gestisce l'accesso radio e si collega direttamente all'EPC (Evolved Packet Core), eliminando elementi come MSC e SGSN. L'EPC include MME (gestione mobilità e sessioni), S-GW (gateway per l'instradamento), e P-GW (gateway per l'accesso a Internet). LTE utilizza OFDMA in downlink e SC-FDMA in uplink, supporta MIMO e garantisce handover rapidi e continui."
  },
  {
    "id": 257,
    "titolo": "Autonomous Systems (AS)",
    "categoria": "Routing",
    "contenuto": "Un Autonomous System (AS) è un insieme di reti IP gestite da un'unica entità amministrativa che applica una politica di instradamento comune. Ogni AS è identificato da un numero univoco chiamato ASN (Autonomous System Number). I router all'interno di un AS utilizzano protocolli di routing interno (IGP), come OSPF o IS-IS. Per comunicare tra AS, si utilizza un protocollo di routing esterno (EGP), tipicamente BGP (Border Gateway Protocol). Gli AS possono essere classificati come stub (connessi a uno solo), multihomed (più connessioni, ma senza transito), o transit (trasportano traffico di altri). La struttura a livelli di AS è fondamentale per il funzionamento scalabile di Internet."
  },
  {
    "id": 258,
    "titolo": "A cosa serve un backbone di rete",
    "categoria": "Infrastruttura di rete",
    "contenuto": "Il backbone è l'infrastruttura principale di una rete, progettata per trasportare grandi volumi di traffico tra diverse reti locali (LAN), aree geografiche o Autonomous Systems. Serve a interconnettere router e switch centrali ad alta capacità, garantendo velocità, affidabilità e scalabilità. In ambito ISP o aziendale, il backbone costituisce il nucleo della rete e gestisce il traffico tra le periferie e altri backbone, nazionali o globali. È essenziale per mantenere bassa la latenza e assicurare la continuità del servizio."
  },
  {
    "id": 259,
    "titolo": "Routing inter-VLAN",
    "categoria": "Reti LAN",
    "contenuto": "Il routing inter-VLAN permette la comunicazione tra dispositivi appartenenti a VLAN diverse. Poiché le VLAN sono domini di broadcast separati a livello 2, per far comunicare host su VLAN differenti è necessario un router o uno switch layer 3. Esistono due metodi principali: il 'router-on-a-stick', dove un router con un'interfaccia trunk gestisce più sottoreti tramite sub-interface; oppure il routing integrato su switch layer 3, che instrada direttamente tra VLAN usando interfacce virtuali (SVI). Questo tipo di routing è essenziale in ambienti LAN segmentati per motivi di sicurezza, prestazioni o organizzazione."
  },
  {
    "id": 260,
    "titolo": "Optical Networks",
    "categoria": "Reti di Comunicazione",
    "contenuto": "Le optical networks sono reti di telecomunicazione che trasportano dati utilizzando segnali luminosi su fibre ottiche. Offrono elevatissima capacità di banda, bassa latenza e lunga distanza senza degrado significativo. Le tecnologie principali includono WDM (Wavelength Division Multiplexing), che consente la trasmissione simultanea di più canali su una singola fibra usando diverse lunghezze d’onda, e OTN (Optical Transport Network) per la gestione e il multiplexing. Le optical networks possono essere statiche (circuit-switched) o dinamiche (es. con switching ottico e provisioning automatico). Sono fondamentali per dorsali Internet, data center e reti di telecomunicazioni ad alte prestazioni."
  },
  {
    "id": 261,
    "titolo": "Selective Flooding",
    "categoria": "Routing",
    "contenuto": "Il selective flooding è una variante del flooding utilizzata per ridurre il numero di copie ridondanti di pacchetti in una rete. Invece di inoltrare un pacchetto su tutte le interfacce eccetto quella di ingresso, il router lo inoltra solo su quelle interfacce che potrebbero ragionevolmente portare verso la destinazione, secondo una stima della topologia. Questo approccio riduce il carico sulla rete mantenendo comunque un buon livello di affidabilità nella consegna dei pacchetti."
  },
  {
    "id": 262,
    "titolo": "Area Border Router (ABR) in OSPF",
    "categoria": "Routing",
    "contenuto": "In OSPF, un Area Border Router (ABR) è un router che connette due o più aree OSPF, inclusa obbligatoriamente l'area backbone (area 0). L'ABR mantiene una copia separata della topologia per ciascuna area a cui è connesso e svolge il ruolo di riassumere e distribuire le rotte tra le aree. Inoltre, propaga le informazioni di routing tramite LSA di tipo 3 (per le reti) e tipo 4 (per identificare gli ASBR). Gli ABR sono fondamentali per il routing gerarchico e per limitare la propagazione degli aggiornamenti di topologia."
  },
  {
    "id": 263,
    "titolo": "Routing Gerarchico",
    "categoria": "Routing",
    "contenuto": "Il routing gerarchico è una tecnica di instradamento in cui la rete è suddivisa in livelli o aree, con l’obiettivo di migliorare la scalabilità e l’efficienza. Ogni router ha visibilità solo sulla topologia della propria area e su un numero ridotto di informazioni sulle altre aree. Questo approccio riduce la dimensione delle tabelle di routing e il carico computazionale. OSPF e IS-IS sono esempi di protocolli che adottano il routing gerarchico, con un'area backbone centrale che connette le aree periferiche. I router di confine, come gli ABR, gestiscono il traffico tra le aree."
  },
  {
    "id": 264,
    "titolo": "OSPF - Database Description Packet",
    "categoria": "Routing",
    "contenuto": "In OSPF, un pacchetto di tipo 'Database Description' (DD) viene utilizzato durante la fase di riallineamento delle adiacenze tra router. Serve per scambiarsi un riassunto delle informazioni contenute nei rispettivi database di stato dei link (LSDB), in modo da identificare eventuali discrepanze. Se un router riceve una descrizione di LSA che non possiede o che ha in versione più vecchia, ne richiederà il dettaglio con un pacchetto di tipo 'LSR' (Link State Request). Questo meccanismo è parte fondamentale del processo di sincronizzazione tra router OSPF adiacenti."
  },
  {
    "id": 265,
    "titolo": "OSPF - Link State Update",
    "categoria": "Routing",
    "contenuto": "In OSPF, il pacchetto di tipo 'Link State Update' (LSU) viene utilizzato per trasportare uno o più LSA (Link State Advertisement) in forma completa. È impiegato durante la fase di sincronizzazione tra router adiacenti, in particolare nella procedura di Exchange, dove avviene lo scambio completo delle informazioni di topologia. Viene anche utilizzato per propagare aggiornamenti successivi alla fase iniziale, quando cambia lo stato della rete. Il LSU è fondamentale per garantire che tutti i router abbiano una copia coerente del database di stato dei link (LSDB)."
  },
  {
    "id": 266,
    "titolo": "Stack di label in MPLS",
    "categoria": "MPLS",
    "contenuto": "In MPLS è possibile avere più label contemporaneamente in un pacchetto grazie al meccanismo dello stack di label. Ogni label è incapsulata sopra il pacchetto IP e può esserci più di una label in pila, con la label più esterna in cima. Questo è utile per scenari come il traffico VPN (dove una label identifica il cliente e un'altra il percorso), o per supportare funzionalità avanzate come il tunneling MPLS o il traffico TE (Traffic Engineering). Lo stack viene elaborato dai router che rimuovono (pop), sostituiscono (swap) o aggiungono (push) le label in base alla logica di instradamento."
  },
  {
    "id": 267,
    "titolo": "Sicurezza nelle VPN MPLS",
    "categoria": "VPN",
    "contenuto": "Le VPN MPLS non richiedono crittografia per garantire l'isolamento del traffico tra clienti. La separazione logica è ottenuta tramite l'uso di label MPLS e routing separato all'interno della rete del provider, che impedisce il mescolamento dei dati tra clienti diversi. Questo approccio è considerato sicuro all'interno dell'infrastruttura del provider, ma non protegge i dati da attacchi esterni come fa una VPN IPsec. Per questo motivo, in scenari ad alta sensibilità, la crittografia può comunque essere aggiunta come ulteriore livello di protezione."
  },
  {
    "id": 268,
    "titolo": "IGRP (Interior Gateway Routing Protocol)",
    "categoria": "Routing",
    "contenuto": "IGRP è un protocollo di routing distance-vector sviluppato da Cisco negli anni '80 per superare le limitazioni di RIP. Utilizza una metrica composta che include banda, ritardo, affidabilità e carico per determinare il miglior percorso. Ha un limite di hop-count di 255 (contro i 15 di RIP) e aggiorna le tabelle ogni 90 secondi. Essendo proprietario e ormai obsoleto, è stato sostituito da EIGRP, che offre migliori prestazioni e convergenza più rapida."
  },
  {
    "id": 270,
    "titolo": "International Mobile Equipment Identity (IMEI)",
    "categoria": "Reti Mobili",
    "contenuto": "L'IMEI (International Mobile Equipment Identity) è un identificativo univoco assegnato a ogni dispositivo mobile. Serve per distinguere il terminale sulla rete, indipendentemente dalla SIM inserita. È utilizzato dagli operatori per bloccare dispositivi rubati o non autorizzati. L'IMEI è assegnato dal produttore, non dal venditore, ed è memorizzato nel dispositivo; in condizioni normali, non è modificabile dall'utente."
  },
  {
    "id": 271,
    "titolo": "Rappresentazione dei router OSPF su una LAN",
    "categoria": "Routing",
    "contenuto": "Nel protocollo OSPF, i router connessi alla stessa rete LAN vengono rappresentati nel grafo della topologia come nodi collegati a un nodo centrale che rappresenta la rete di broadcast (la LAN). Questo nodo centrale è un router logico chiamato Designated Router (DR). In termini logici, le connessioni formano una topologia a stella, con il DR al centro e gli altri router come nodi periferici. Questo approccio evita la costruzione di un grafo completamente connesso, riduce il numero di Link State Advertisement (LSA) e semplifica il calcolo della topologia tramite l'algoritmo SPF."
  },
  {
    "id": 272,
    "titolo": "Schema di indirizzamento IPv6 su LAN",
    "categoria": "IPv6",
    "contenuto": "Nel modello di indirizzamento IPv6, è previsto che i primi 64 bit di un indirizzo rappresentino il prefisso di rete, specialmente nelle reti LAN. I restanti 64 bit sono utilizzati per l'identificatore dell'interfaccia (Interface Identifier), che può essere assegnato manualmente, generato automaticamente o derivato dall'indirizzo MAC tramite EUI-64. Questa divisione è standardizzata per garantire interoperabilità, supporto al Neighbor Discovery e compatibilità con l'autoconfigurazione stateless."
  },
  {
    "id": 273,
    "titolo": "Assegnazione casuale dell'Interface Identifier in IPv6",
    "categoria": "IPv6",
    "contenuto": "L'identificatore di interfaccia (Interface Identifier) in IPv6 può essere assegnato casualmente quando si utilizza l'autoconfigurazione stateless con meccanismi di privacy, come definiti nelle Privacy Extensions (RFC 4941). In questo caso, l'ID non viene derivato dall'indirizzo MAC, ma generato in modo pseudocasuale per proteggere la privacy dell'utente. Questo approccio viene spesso usato nei dispositivi mobili e nei sistemi operativi moderni per evitare il tracciamento persistente dell'hardware attraverso la rete."
  },
  {
    "id": 274,
    "titolo": "Fase finale del routing Link State",
    "categoria": "Routing",
    "contenuto": "Nella fase finale di un algoritmo di routing di tipo Link State, ogni router esegue l'algoritmo di Shortest Path First (SPF), solitamente l'algoritmo di Dijkstra. Come input utilizza il Link State Database (LSDB), che rappresenta una mappa completa e sincronizzata della topologia della rete. Il risultato del calcolo è la tabella di instradamento del router, che indica il percorso più breve verso ogni destinazione raggiungibile nella rete."
  },
  {
    "id": 275,
    "titolo": "Fase finale del routing Link State",
    "categoria": "Routing",
    "contenuto": "Nella fase finale di un algoritmo di routing di tipo Link State, ogni router esegue l'algoritmo di Shortest Path First (SPF), solitamente l'algoritmo di Dijkstra. Come input utilizza il Link State Database (LSDB), che rappresenta una mappa completa e sincronizzata della topologia della rete. Il risultato del calcolo è la tabella di instradamento del router, che indica il percorso più breve verso ogni destinazione raggiungibile nella rete."
  },
  {
    "id": 276,
    "titolo": "Distribuzione degli indirizzi IPv6 Global Unicast Aggregable",
    "categoria": "IPv6",
    "contenuto": "Gli indirizzi IPv6 Global Unicast Aggregable sono univoci a livello globale e vengono assegnati secondo una struttura gerarchica, solitamente basata su criteri geografici o organizzativi. Questo schema permette una migliore aggregazione delle rotte a livello di backbone Internet, riducendo la dimensione delle tabelle di routing e migliorando la scalabilità. La parte iniziale dell’indirizzo identifica il provider o il blocco regionale, mentre la parte successiva può essere suddivisa tra le organizzazioni e le reti locali."
  },
  {
    "id": 277,
    "titolo": "Operazioni sui label in MPLS",
    "categoria": "MPLS",
    "contenuto": "Un router MPLS può eseguire tre operazioni fondamentali sui label MPLS: PUSH, POP e SWAP. L'operazione PUSH consiste nell'aggiungere un label in cima allo stack di label, tipicamente all'ingresso dell’LSP (Label Switched Path). L'operazione POP rimuove il label più esterno, generalmente alla fine del percorso o in prossimità della destinazione. L'operazione SWAP sostituisce il label esterno con un nuovo valore, ed è l'azione più comune nei router intermedi. Queste operazioni permettono l'instradamento efficiente dei pacchetti attraverso una rete MPLS."
  },
  {
    "id": 278,
    "titolo": "Caratteristica delle VPN overlay",
    "categoria": "VPN",
    "contenuto": "Una VPN realizzata secondo uno schema overlay è implementata sopra l'infrastruttura di rete esistente, senza richiedere il coinvolgimento del gestore della rete sottostante. Questo significa che i router e gli switch della rete di transito non sono a conoscenza dell'esistenza della VPN e trattano il traffico come normale traffico IP. La gestione della VPN, compresi tunneling e crittografia, è interamente a carico degli endpoint o di dispositivi dedicati ai bordi della rete."
  },
  {
    "id": 279,
    "titolo": "LSA di tipo Network Link in OSPF",
    "categoria": "OSPF",
    "contenuto": "Nel protocollo OSPF, gli LSA (Link State Advertisement) di tipo Network Link sono generati dal Designated Router (DR) per ogni rete di tipo broadcast o NBMA. Questi LSA descrivono tutte le adiacenze tra il DR e i router adiacenti sulla rete condivisa. Includono quindi l'identificativo della rete (IP + mask) e gli ID OSPF di tutti i router adiacenti al DR su quella rete. Questi LSA permettono di rappresentare nel grafo di topologia le connessioni logiche tra i router attraverso la rete di transito (es. una LAN Ethernet)."
  },
  {
    "id": 280,
    "titolo": "LAN Ethernet",
    "categoria": "Reti LAN",
    "contenuto": "Una LAN Ethernet è una rete locale basata sulla tecnologia Ethernet, ampiamente utilizzata per collegare dispositivi all'interno di un'area geografica limitata (uffici, abitazioni, campus). Utilizza lo standard IEEE 802.3, con trasmissione a frame e identificazione dei dispositivi tramite indirizzi MAC. In una LAN Ethernet moderna, i dispositivi sono collegati a switch che operano in modalità full-duplex, eliminando le collisioni e migliorando le prestazioni rispetto ai vecchi hub. Le LAN Ethernet supportano varie velocità di trasmissione, da 10 Mbps fino a 100 Gbps e oltre."
  }
]
